[
    {
        "name": "Veldora Tempest",
        "detail": "Veldora Tempest, also known as Storm Dragon Veldora, is one of the five True Dragons. He has two forms: a human form and a dragon form. In his human form, Veldora appears as a tall, handsome man with blond hair. In his dragon form, he has a gigantic body covered in black steel like scales, with bluish wings and golden eyes.\n\nVeldora is known for his boisterous and excitable personality, but he is also easysgoing. Despite his reputation as a rampaging dragon, Veldora is only dangerous when he doesn't get to unwind or when his loved ones are threatened. He is energetic, prideful, and enjoys showing off his strength. Veldora is socially awkward and lacks social tact, often intimidating others without realizing it. However, he is also knowledgeable and curious about many things.\n\nAfter meeting Rimuru, the protagonist of the story, Veldora starts to reconsider his destructive behavior. He becomes more patient, analytical, and less impulsive. He greatly appreciates Rimuru as his sworn friend and trusts him. Veldora sees Rimuru as an equal and encourages him to bring more entertainment to the world. Veldora also has a deep respect for his older brother, Veldanava, and holds a perpetual fear of his formidable sisters, Velzard and Velgrynd.\n\nVeldora was born as the incarnation of chaos and has control over wind, water, and space. He has always been plagued by a sense of restlessness, leading to destructive rampages and violent storms. His encounters with his sisters have left him with a fear of them. Veldora's boredom led him to destroy a vampire city ruled by Demon Lord Luminous Valentine, which earned him the grudges of the Queen of Nightmares.\n\nVeldora's life changed when he met Rimuru, a slime who became his friend. Rimuru stored Veldora in his stomach while trying to find a way to release him from his imprisonment. During this time, Veldora went through Rimuru's memories and developed a friendship with Ifrit, who joined him in Rimuru's stomach. Eventually, Veldora was released from his imprisonment with the help of Rimuru's evolving abilities.\n\nCurrently, Veldora resides in one of Rimuru's clones and shares powers with him through a Soul Corridor. He is functionally immortal as long as Rimuru lives. Veldora is aware of the existence of Ciel, an artificial intelligence, and is one of the few individuals who know about her.\n\nIn addition to his dragon abilities, Veldora is also a skilled cook, surprising many with his culinary skills. He works at a Takoyaki stand during festivals and impresses people with his delicious food.\n\nOverall, Veldora is a powerful and lively character who undergoes personal growth and forms a strong bond with Rimuru. His actions and interactions with others play a significant role in the story."
    },
    {
        "name": "Rimuru Tempest",
        "detail": "Rimuru Tempest is the main protagonist of the anime and manga series \"That Time I Got Reincarnated as a Slime.\" Rimuru is the reincarnation of Satoru Mikami, who is transformed into a slime in a fantasy world. Rimuru's appearance varies depending on their form. In their slime form, Rimuru is a spherical, slightly blue and translucent ooze. As they become stronger, their slime form increases in size. Rimuru can also take on different forms, such as a metallic Metal Slime or a Gold Slime.\n\nIn their human form, Rimuru's facial features are similar to those of Shizu, but they have long silver hair and deep golden eyes. Rimuru can also be seen wearing Shizu's mask or dragon like wings. Rimuru's human appearance changes as they evolve and gain new abilities. Initially, Rimuru appears as a child around the age of six or seven, wearing a simple outfit made of pelts. After consuming the Orc Disaster Geld, Rimuru's appearance changes, and they look like a child around the age of nine, wearing black pants and a white and gold shirt. As a True Demon Lord, Rimuru appears as a child around the age of ten to twelve, wearing black pants, a black and gold shoulderless shirt, and a fur scarf. After evolving into a True Dragon and reincarnating into an Ultimate Slime, Rimuru's human form is that of a 15 16 year old adolescent, wearing black pants and a black sleeveless long shirt with white accents.\n\nRimuru's personality is eccentric and childish, but they are also intelligent and strategic. They carefully analyze and plan their actions, making calculated decisions. However, Rimuru can be ruthless when dealing with those who anger them, resorting to torture and murder if necessary. Despite their sometimes selfish and nefarious tendencies, Rimuru deeply cares for their subordinates and views them as family. They also rely on the memories of their human self, Satoru Mikami, and Shizu to guide their ethical decisions.\n\nRimuru's goal is to create a convenient world where they can relax and enjoy entertainment similar to what they experienced on Earth. They hold various titles, such as Chaos Creator, Rising Star, True Demon Lord, Chancellor of the Great Jura Alliance, and Ruler of Monsters. Rimuru has a partner named Ciel and is related to Veldora Tempest, Velgrynd, Velzard, and Veldanava. They reside in the Jura Tempest Federation and are the Monarch of Tempest. Rimuru is also an adventurer and holds the rank of Special S. They are affiliated with various organizations, including the Jura Tempest Federation, Octagram, Council of the West, Free Guild, and Three Wise Drunks."
    },
    {
        "name": "Rimuru City",
        "detail": "Rimuru City, originally an empty plot of land, has developed into a bustling capital city under the rule of Rimuru Tempest. The city was established following the population boom caused by the addition of the forest's remaining goblin population. Rimuru chose a location near the Sealed Cave where Veldora Tempest was formerly sealed, as it had nearby water and cleared land suitable for farming.\n\nThe development of the city accelerated after the defeat of the Orc Disaster and the addition of the High Orcs to Rimuru's ranks. It eventually earned the approval of the Dwarf King as a legitimate town and became the capital city of the newly formed Jura Tempest Federation.\n\nRimuru City boasts various important facilities, including an arena, a musical hall, a dungeon, the Prime Minister's office, and the Supreme Court. The city has a well planned layout with roads leading to and from the city to facilitate travel. It also has a capital building to house the Jura Tempest Federation Government, where political, economic, and social issues are discussed.\n\nThe city is home to various inhabitants, including slimes, goblins, hobgoblins, Tempest Wolves, High Orcs, Kijin/Oni, Dragonewts, daemons, dwarves, true dragons, and humans. The slimes, being friendly creatures, serve as cleaners in the city, devouring dirt and trash. The goblins and hobgoblins, numbering at least 500, play important roles as government officials. The Tempest Wolves, numbering at least 100, work alongside the hobgoblins as Goblin Riders.\n\nThe High Orcs, numbering around 2000, serve as general labor and construction workers, helping build the city's infrastructure. The Kijin/Oni, a group of six ogres, became Rimuru's loyal servants after being named by him. The Dragonewts, with a population of over 100, joined Rimuru's alliance after the defeat of the Orc Lord. The daemons, numbering 711, pledged their loyalty to Rimuru after being named and given bodies by him. The dwarves, numbering at least 5, were recruited by Rimuru to help with construction and textile works. The true dragons, Veldora and Rimuru, act as the guardian deity and the final boss of The Dungeon, respectively.\n\nAs Rimuru City grew in importance as a hub for merchants and adventurers, more humans moved into the city. They formed the Volunteer Corps of approximately 20,000 members and volunteered to defend Tempest during the invasion of the Eastern Empire.\n\nRimuru Tempest, the founder and ruler of Rimuru City, also serves as the chief manager. Other key individuals in the city include Rigurd, Shuna, and various humans who have become important figures in the city's development and defense.\n\nRimuru City is located in the Jura Forest and has a population of over 150,000. It is an active and thriving city, with various departments such as construction and manufacturing, war, intelligence, defense, business, and publicizing. The city's professional information is managed by Rimuru Tempest, Rigurd, and Shuna."
    },
    {
        "name": "Jura Forest",
        "detail": "The Great Jura Forest is a large woodland located in the center of the Magic Continent. It is currently under the control of Demon Lord Rimuru Tempest. The forest has served as a buffer zone between countries, preventing direct confrontations for a long time. It is unclear whether the land was originally barren or already a forest, but it was inhabited by the Storm Dragon Veldora for centuries. Under Veldora's influence, the forest expanded and became a vast territory. When the Dryads and Treants led by Treyni were seeking a new home, Veldora welcomed them into the forest. The Dryads took on the responsibility of maintaining order in the forest, with Veldora acting as its guardian. Together, they provided security for the monsters living in the forest.\n\nThe forest was protected by a mutual pact among the demon lords, which prevented them from entering the forest to avoid undoing Veldora's seal. The presence of the dragon, even in his sealed state, deterred the Eastern Empire from invading. The monsters in the forest believed they were under divine protection from the Storm Dragon, allowing them to live in the intense magical energy emitted by Veldora. However, after Rimuru became a demon lord and joined the Octagram, he was granted ownership of the entire Jura Forest. Some parts of the forest were cleared to establish the city of Tempest, and any future development in the forest requires permission from Demon Lord Rimuru to access its resources.\n\nThe forest can be accessed through three paths. One path runs from the Canaat Mountain range, while another follows the Great Ameld river, connecting the north and south forests. However, the river does not flow in a straight path, making it difficult for a large army to traverse. It is possible to cross the river where it meets the Eastern Empire's river, but it is still not suitable for a large army.\n\nAt the center of the forest lies Lake Siss, surrounded by a marshland controlled by the Lizardmen. The marshes are filled with countless caves, forming a natural labyrinth that prevents invasion. The Lizardmen have peacefully ruled over the lake, while the western route was previously home to the Ogre's village before its destruction.\n\nThere is a treant settlement in an isolated part of the forest. The treants are unable to leave their dwelling, so the dryads act on their behalf to protect the forest from any potential threats. After reuniting with Ramiris, their settlement was transferred to Floor 95 of The Dungeon, where they live harmoniously with the elves.\n\nSince the establishment of the Jura Tempest Federation, the number of races living in the forest has increased. Some of these races also inhabit The Dungeon. The known inhabitants of the forest include goblins, ogres, lizardmen, orcs, dryads, treants, elves, tengu, gozu, mezu, dragons, humans, undead, daemons, elementals, insectars, and cryptids."
    },
    {
        "name": "Milim Nava",
        "detail": "Milim Nava is one of the first generation Demon Lords. She's the best friend of Rimuru Tempest and serves as an important ally.\nAppearance\nConcealed Form\nShe normally looks like a youthful human girl around the age of fourteen to fifteen, making many people confuse her as a child at first. She has glossy Platinum Pink hair tied in twin tails and blue eyes. She usually wears a rather bold swimsuit like outfit consisting of thigh high socks, black panties, and a long sleeve shirt that only covers her chest, with the occasional addition of a large cloak.\nIn the kid's version of Light Novel, her outfit was toned down. She wears a longer shirt that covers almost all of her midriff, a black skirt, light colored leggings, and black shoes with a pink bottom.\nTrue Form\nIn this form, Milim looks more like the Dragonoid that she is, having a crimson horn adorning her forehead and large wings. In this state, she usually wears proper battle attire consisting of jet black armor.\nPersonality\nMilim, by nature, is a rather childish and outspoken individual. She isn't afraid to speak her mind and throws away any pretense of formalities. This, however, shouldn't be mistaken as her having the mind of a child. Those who can look past her childish demeanor will find a fierce, extremely intelligent woman who cannot be tricked or outsmarted even by the brightest minds. Despite this intellect, her tendency to be inconsiderate of other people and do whatever she wants often results in her overlooking the complexity and importance of a situation entirely, in favor of a more straight forward approach. She is also extremely sensitive to gossip, especially when it relates to her, and anybody that insults or underestimates her often ends up dead or close to it as a result.\nHer jaded, lonely, and violent attitude has been somewhat whittled away after meeting Rimuru and spending time in Tempest. She begins to open up and makes more and more friends across the course of the series, with the revival of her sibling Gaia, in particular, filling her with immense happiness.\nBackground\nMilim was born millennia ago as a princess of the Nasca Kingdom. She, for a time, lived a happy and peaceful life with her father Veldanava, mother Lucia, and sibling Gaia. However, tragedy struck when her father and mother unexpectedly passed away. She was well taken care of by servants, but her uncle, the king, refused to see her. With Gaia the only family member she had left, she grew up unable to remember the faces of her parents and unaware of her relation to the king. Only having each other, Gaia and Milim's bond grew more than ever, with the two never leaving each other's side, even sleeping in the same bed huddled together.\nThese peaceful times too were not fated to last. A group from the Super Magic Kingdom of the Elves had infiltrated the Nasca Kingdom and intended to take Milim and use her power as their own. Gaia stood in the way of their assailants, doing its best to protect Milim, but it was eventually cut down and killed. Milim, having lost everything and everyone close to her, began to lose her sanity. Her mind went blank with rage as the massive power she inherited from her father came bubbling to the surface and she set out to take revenge. She made her way to the capital of the Super Magic Kingdom and began to destroy everything and everyone in sight, starting by wiping out the castle and the King that was inside of it with a massive flash of light. In her rampage, having killed hundreds and thousands of people, she became a True Demon Lord and the resulting harvest festival brought her beloved Gaia back to life. Gaia, being corrupted by Milim's anger, took on the form of a mindless Chaos Dragon and, following Milim's command, began terrorizing the elves of the Super Magic Kingdom. The death and destruction in Milim's wake was so destructive that the Demon Lord Guy Crimson had to step in to prevent the damage from spreading to the whole world. Guy and Milim fought each other for seven days and seven nights with no clear winner arising between the two. Eventually, the Elemental Queen, Ramiris, stepped in and managed to pacify Milim's rage at the cost of her purity.\nMilim, having come to her senses, was filled with only a deep sadness. She confronted Gaia who, by her own hand, had been brought back as a mindless Chaos Dragon, and decided to seal away the last family member she had left. Guy and Ramiris did their best to console the grieving Milim, with the three coming together to form the Demon Lord Council with the trio as its founding members. Milim, for her part, began to help as many people as she could, perhaps in recompense for her past actions. She slew powerful monsters and magical beasts that were attacking towns and cities and became an arbitrator for international disputes. This culminated in her discovery of the Dragonewts, a race of Demi Humans born from the union of humans and the dragons that had spawned from Gaia's essence. As the closest thing she had to a family, she took in the dragonewts and protected them, with the City of the Forgotten Dragon eventually being built by them in her honor.\nOver time, Milim eventually grew more and more Jaded with the world. The memories of her early days had grown into a blur that she didn't care to remember and she eventually stopped interfering with the world altogether. Instead, she took to the ever growing members of the demon lord council to sate her inevitable boredom. She began to take a keen interest in strong individuals and gave them her support to join the council, with the hope of them eventually offering her a fun fight. It was in one of these plots, the puppet demon lord project that culminated in the Orc Disaster, that she discovered the existence of a certain silver haired majin and set out to make it her subordinate.\nAbilities\nMilim is one of the oldest Demon Lords among the Octagram and a genuine Catastrophe class, one of the strongest beings in the world. She once fought Guy Crimson for 7 whole days until Ramiris stepped in and managed to pacify her.\nSkills\nUltimate Skills\n* Satanael, Lord of Wrath\n   * Magicule Breeder Reactor\n   * Stampede\nUnique Skills\n* Milim Eye\n   * Analytical Appraisal\n   * Magic Measurement\n* Milim Ear\nExtra Skills\n* Multilayer Barrier\n* Spatial Motion\n* Spatial Storage \nArts\nMagic\nElemental Magic\n* Spatial Magic\n   * Teleportation\n   * Dress Change\nTrue Dragon Magic\n* Star King Magic\n   * Drago Nova \n   * Drago Buster \n   * Invisible Barrier \nBattlewill\n* Milim Punch - Milim gathers a ridiculous amount of aura into her fist and beats up the baddies.\n* Milim Kick - Milim gathers an outrageous amount of aura into her leg then kicks any meanies away.\nOther Abilities\n* Master Swordsmanship\nEquipment\n* Asura\n   * God Grade Sword\n   * A blade spoke of in legend to have slain countless majin and demon lords as the strongest weapon in existence.\n   * Made by Veldanava himself, paired with Rudra's Deva. Given to Guy before he gave it to Milim.\n* Dragon Knuckles\n   * Unique Grade Gauntlets\n   * Reduces Milim's physical power greatly allowing her to have more fun fighting weaker opponents.\n   * Made using Magisteel and enchanted with Speed Reduction and Power Drain by Rimuru and co.\n* Demon's Ring\nMagic Item\nMagic Communication Enchantment\n"
    },
    {
        "name": "The Jura Tempest Federation",
        "detail": "The Jura Tempest Federation, also known as Tempest, is a country situated in the Jura Forest and was established by Rimuru Tempest. The nation began as a new Goblin village constructed by Dwarven Craftsmen near the Sealed Cave. The village later allied with the Lizardmen, emancipated Orcs (now High Orcs), surrounding Goblins (now Hobgoblins), the Dryads, and the Treants to form the Jura Forest Alliance. This alliance eventually evolved into the Jura Tempest Federation, marking the nation's founding with a magical treaty with the Armed Nation of Dwargon.\n\nThe Jura Tempest Federation is governed by Demon Lord Rimuru, who serves as the Monarch and the active Head of State. The cabinet is headed by Prime Minister Rigurd, who has the highest authority for internal affairs, excluding wartime, after Rimuru. The cabinet comprises several ministries, each responsible for different aspects of the nation's governance. These include the Ministry of Internal Affairs, Ministry of Foreign Affairs, Ministry of Legislation, Ministry of Justice, Ministry of Defense, Ministry of Intelligence, Ministry of Treasury/Finances, Ministry of Infrastructure, Ministry of Agriculture, and Ministry of Science.\n\nThe Jura Tempest Federation's military strength has grown significantly since its humble beginnings as a goblin village. As of Volume 12, the nation has amassed a formidable military force in anticipation of the Eastern Empire's invasion. The nation also manages a Dungeon, which is jointly controlled by Ramiris and Rimuru, with the 91st to 93rd floors reserved for industrial purposes, and the 94th floor containing the city of Labyrinth and a secret research facility.\n\nThe Jura Tempest Federation has established various foreign relations, with the Armed Nation of Dwargon being the first to recognize the Jura Forest Alliance as a sovereign nation, leading to the official formation of the Jura Tempest Federation. The two nations entered a treaty that included a non aggression pact, a promise of assistance if either nation is endangered, the construction of a road to Dwargon, guaranteed safety for Dwarves within the Forest of Jura, and sharing of technology between the two nations. The Kingdom of Blumund, the Sorcerer's Dynasty Sarion, the Farmenas Kingdom, the Holy Empire Ruberios, and Demon Lord Milim's Domain also have various levels of diplomatic relations with the Jura Tempest Federation.\n\nThe Jura Tempest Federation, due to its central geographical location, sound military security, extensive infrastructure, and road systems, is a significant economic hub. Many nations trade or pass through the Jura Tempest Federation while trading with other nations. The nation's chief exports are mainly high quality manufactured goods, including potent healing potions, alcohol, fine fabric clothing, and top tier dwarven/ogre crafted weapons, armor, and accessories.\n\nThe nation's economy operates on a system of Effort Points, which are accumulated by individuals as they work, with more points earned for good performance and fewer for poor performance. Expensive products and services, such as gourmet food, magisteel armor/weapons, finer clothing, and VIP services, all cost Effort Points. This system was established as a solution to the problem of monster residents refusing to be paid with money, which was stagnating the economy.\n\nThe Jura Tempest Federation is home to several buildings of interest, including Rimuru's house, a small single room house designed in a traditional Japanese manner, and the Government Building, the largest building in the nation, which is the center of politics and city planning."
    },
    {
        "name": "The Dungeon",
        "detail": "The Dungeon in the world of Tempest was created using Ramiris' Intrinsic Skill, Small World. It is a part of Tempest and also falls under Ramiris' territory. Rimuru, the leader of Tempest, granted Ramiris extraterritorial rights on the dungeon when he gave her permission to establish it. The inside of the dungeon is under the joint control of Rimuru and Ramiris, and it is established as a special area with joint sovereignty.\n\nThe dungeon is ruled by Veldora, the powerful dragon who is also one of Rimuru's friends. Ramiris supervises the dungeon and ensures its smooth operation. The layout of the dungeon can be changed every few days using special blocks, allowing for variety and surprise for the challengers.\n\nThe dungeon has various features and offers unique challenges for adventurers. Veldora constantly flaunts his aura on the 100th floor, which increases the magicule concentration and causes monsters to spawn. The upper floors of the dungeon are occupied by stronger monsters, while the lower floors are filled with smaller, weaker creatures.\n\nTo enter the dungeon, adventurers must pay an entry fee of three silver coins. At the entrance, Ramiris sells several exclusive magical items that she has crafted to aid the challengers in their quest. These include the Resurrection Bracelet, which negates death and heals all wounds, the Return Whistle, which allows instant escape, and the Recording Crystal, which creates a save point for the next entry. There are also treasure chests scattered throughout the dungeon, some of which are guarded by monsters. These chests contain various rewards, including potions, items, coins, and prototype equipment.\n\nThe dungeon incentivizes challengers to hunt monsters by allowing newly born monsters to swallow items and equipment, which can then be obtained as drops. This not only provides additional rewards for the challengers but also helps in supplying the market with magic crystals and monster parts.\n\nThe dungeon has multiple floors, and every 10 floors, there is a \"Boss Floor\" with a powerful guardian as the boss. These floors act as milestones for the challengers, and the first five parties to clear each boss floor in a given month receive gold coins as rewards. As the challengers progress through the dungeon, the traps and obstacles become more dangerous and challenging.\n\n1:\nThe first floor is a square shaped room spanning 250m on each side. It contains the front desk for managing entries into the dungeon as well as a gym and training areas for learning the basics of dungeon crawling. People who die on this floor, for the sake of safety, are automatically ressurected even without a revival bracelet.\n\n2-4:\nThis is where the dungeon really begins. There are no \"Instant Death\" traps and the enemies are small fry of F Rank. Treasure Rooms here are guarded by a single D ranked monster and contain common but useful goods such as low potions.\n\n5:\nA floor where tougher monsters of D Rank can start to be found as random enemies. Treasure Chests start containing actual equipment and sellable market goods starting on this floor.\n\n10:\nThe first floor containing a 'boss' in the form of a B Rank Black Spider. The first five parties to clear it in a given month will recieve three gold coins.\n\n20:\nA boss floor containing a B plus Evil Centipede. The first five parties to clear it in a given month will recieve five gold coins.\n\n30:\nA boss floor containing a B plus Ogre Lord and his five subordinates. The first five parties to clear it in a given month will recieve ten gold coins. Additionally \"Slotted\" weapons will begin appearing as super rare loot in treasure chests.\n\n40:\nA boss floor containing the A minus ranked Tempest Serpent. The first five parties to clear it in a month will recieve twenty gold coins. Additionally \"Slotted\" weapons will begin to appear as boss drops after this floor.\n\n41-49:\nAt this point the traps begin to get 'serious', one careless step or sharpy turned corner could result in instant death.\n\n49:\nThe primary obstacle of this floor is Slimes. The slimes can merge together creating massive walls immune to physical attacks that prevent escape while closing in on their victims. Other dangers include corridors where the floor is made of slime, slimes that rain down from the ceiling, and insanely durable golems made of slimes. Each of these slimes are extremely corrosive and will completely dissolve a challengers equipment over time.\n\n50:\nA boss floor jointly guarded in shifts by the A plus ranked Gozul, and Mezul. The first party to clear it in a month will recieve one hundred gold coins. The boss chest for this floor has a chance to contain pieces from the unique grade \"Minos\" equipment set. Additionally \"Slotted\" weapons will begin to appear as rare drops from monsters.\n\n51-60:\nThese floors are filled with traps made of scientific weapons like laser beams, sonic cannons, poisonous gas, and large numbers of golems.\n\n60:\nA boss floor that has a Demon Colossus piloted by Gadra as its guardian. After this point the enemies have a much greater intelligence and work in a semi organized manner, increasing the difficulty drastically.\n\n61-70:\nFloors filled with Undead summoned by Adalman. These floors are collectively called the Haven of the Dead .\n\n70:\nA boss floor styled like a necropolis named Deathtopia . Its guardian is Adalman with Albert serving as his vanguard and Venti as the tank.\n\n71-80:\nThese floors are occupied by giant insects, including deadly Army Wasps under Apito's command.\n\n79:\nA floor that has Apito as its boss.\n\n80:\nA boss floor with the overwhelmingly powerful Zegion as its guardian.\n\n81-90:\nThese floors are a paradise for magic beasts. From the 82nd floor onwards, each floor is guarded by one of the Eight Legions.\n\n90:\nA boss floor that rarely sees any challengers. Kumara is its guardian and she resides within a luxuious mansion on the floor itself.\n\n91-94:\nThese floors serve as production and storage facilities.\n\n91st floor: Storage facilities for metal ores.\n92nd floor: Magisteel production.\n93rd floor: A farm to cultivate Hipokute Herbs for potions.\n94th floor: Garden and honey production facilities.\n\nThe 95th floor serves as a hub and has important facilities such as an Adventurer's Inn, Equipment Shop, Elf Cabaret, and Research Facility. It also serves as the last save point before the final boss. Only those who have legitimately reached and cleared the 90th floor have free access to all facilities on this floor.\n\nThe 96th to 99th floors are known as the Dragon Floors and are inhabited by Dragon Lords. Each floor is themed around a specific element, and the dragons have changed the surroundings to match their element. The dragons feed on the magicules released by Veldora, allowing them to live there without issue.\n\nThe 100th floor is the final floor of the dungeon and is known as the Dwelling of Spirits. It is guarded by Veldora himself, who is the strongest guardian. The floor has various facilities, including Veldora's private room, Rimuru's private lab, Ramiris' private lab, and the Strategic Military Control Battle Command Center. This floor also has a separate entrance for emergency situations, and the entire city of Rimuru can be transported there to protect the citizens.\n\nIn addition to the various floors and challenges, the dungeon also features traps and terrain effects that add to the difficulty and excitement of the dungeon crawling experience. Some of these traps include airtight rooms, poison arrows, poison swamps, rotating and moving tiles, cutting threads, pitfalls, false treasure boxes, and various slime related dangers.\n\nOverall, the dungeon in Tempest is a complex and dynamic place, offering adventurers a wide range of challenges, rewards, and surprises. It is a carefully designed and controlled environment created by Ramiris and Rimuru to provide entertainment and opportunities for growth to the inhabitants of Tempest."
    },
    {
        "name": "Monster",
        "detail": "Monster is a term that refers to all Magicule based life forms. As magical beings, monsters do not require the essentialities of normal life forms—such as eating, drinking, sleeping, or breathing—and instead only require sufficient magicules for sustenance.\n\nThere are three manners in which a monster may come into existence.\n* Spawning, where the monster is born out of the Factor and magicules either latent within the surroundings or let off by a \"parent\" monster. \n* Biological Reproduction that has either a singular monster or a pair of compatible monsters engage in regular biological reproduction.\n* Mutation of non magic lifeforms—plants, animals, humans, demi humans, spirits, or mystic beasts—into magic lifeforms. It occurs when the subject is exposed to more magicules than it can handle. While this would normally result in death, they can occasionally be reborn as a monster.\nMajin\nMain article: Majin\nThe term \"Majin\" refers to monsters that possess proper intelligence and rational thought similar to humans and demi humans.  A monster can be a majin from birth (such as Vampires, Giants, and Daemons), become one later in life via evolution, or be born by the monsterization of an already intelligent lifeform, i.e Humans and Demi Humans. \nNamed Monsters\nNamed Monsters  are monsters who are Named. Named monsters usually have a much easier time acquiring skills and have almost always evolved into a higher race.\nUnique Monsters\nUnique Monsters  are individuals of a particular race of monster born with certain characteristics, traits, or abilities not found within the typical member of their species. These individuals are usually much stronger and smarter than their ordinary counterparts. Examples include the Orc Lords and Rimuru Tempest.\n\n* While many Demi Human races, such as Goblins, Orcs, Lizardmen, and etc are often called \"Monsters\" the term used for them is Demonic Tribe  which collectively refers to intelligent enemies of humanity regardless of their status as magical beings.\n* As there is no set standard for members of their race and because of the circumstances behind their birth, True Dragons are each individually considered \"Unique Monsters\"."
    },
    {
        "name": "Rank",
        "detail": "Rank is a general system created by people to classify and categorize the degree of power held by races of Monsters as well as special individuals.\n\nPower Ranking Systems:\nFree Guild System:\nA revolutionary system created by Yuuki Kagurazaka that was quickly adapted by the entire world for it's ingenuity. It classifies monsters and other hostiles by taking into account a variety of variables such as Magicule Count, Physical Strength, Defensive Capabilities, Speed, Skills, and Intelligence. Average rankings are often given to an entire species, with further reclassification being given to specific individuals based on special factors like the possession of equipment and arts.\n\nF Rank : A ranking assigned to those who possess little to no combat capabilities.\nE Rank : A ranking assigned to those who possess power equivalent to the average Human adult.\nD Rank : A ranking assigned to those who have power equivalent to a soldier, requiring a group of at least 3 or 4 average humans to defeat.\nC Rank : A ranking assigned to those who have power equivalent to or above an experienced soldier with professional training.\nB Rank : A ranking assigned to threats that have the potential to wipe out an entire village singlehandedly.\nA Rank : A ranking assigned to threats that have the potential to severely damage an entire town, requiring the deployment of several high ranking adventurers or a nations knights to be taken care of.\nSpecial A Rank : A ranking assigned to threats that have the potential to destroy a small sized nation, requiring the deployment of a nation's army or a Champion class individual to defeat.\nS Rank : A ranking assigned to Demon Lords and those of equivalent power, requiring a large nation's entire military and the deployment of their Champions to defeat.\nSpecial S Rank : A ranking assigned to threats that no singular nation could hope to stand up against, such as True Demon Lords and True Dragons. It is believed that such threats can only be dealt with by the intervention of a Chosen Hero.\nTempest System:\nA system used internally by Tempest's government and used in their management of the Dungeon. It's a stripped down version of the Free Guild's system, using an objective numerical measurement of an individual's Existence Value –called Existence Points– to assign them a ranking and adjust the dungeon's difficulty accordingly.\n\nE Class : A ranking given to those with an EP below 1,000.\nD Class : A ranking given to those with an EP between 1,000 and 3,000.\nC Class : A ranking given to those with an EP between 3,000 and 6,000.\nB Class : A ranking given to those with an EP between 6,000 and 8,000.\nB+ Class : A ranking given to those with an EP between 8,000 and 9,000.\nA- Class : A ranking given to those with an EP between 9,000 and 10,000.\nA Class : A ranking given to those with an EP between 10,000 and 100,000. It is also referred to as A Rank Over  and is equivalent to Hazard class.\nSpecial A Class : A ranking given to those with an EP between 100,000 and 400,000. It is equivalent to Calamity class.\nS Class : A ranking given to those with an EP between 400,000 and 800,000. It is equivalent to Disaster class.\nSpecial S Class : A ranking given to those with an EP over 800,000\nMillion Class : A general term used to refer to those with an EP over 1,000,000.\nCatastrophe Class : The sole ranking used by Tempest that relies on Combat Power instead of Existence Points, reserved only for those with transcendent power that begins to approach the domain of True Dragons.\nMutual Aid Association System\nA precursor to the ranking system utilized by the Mutual Aid Association of Adventurers. It is extremely crude and imprecise compared to the more modern and scientific ranking systems, resulting in many preventable deaths over the years. It was abandoned completely after Yuuki Kagurazaka reformed the Mutual Aid Association into the Free Guild and became the new Grandmaster.\n\nNovice: A difficulty rating given to tasks that anyone could do, equivalent to the Free Guild's F Rank.\nBeginner: A difficulty rating given to tasks that required some level of competency, equivalent to the Free Guild's E Rank.\nIntermediate: A difficulty rating given to tasks that required someone experienced, equivalent to the Free Guild's D Rank.\nAdvanced: A difficulty rating given to tasks that required seasoned veterans, encompassing the equivalent of Ranks C A in the Free Guild System.\nDanger Level:\nDanger Level is an older classification, separate from regular rankings, meant to classify the danger level of Monsters and Majin. Unlike the Free Guilds ranking system, it's classified by overall threat level and not just combat capabilities. Additionally, it is subjected to inaccurate listings due to political interference, with classifications of certain individuals being listed as a lower rank than what knowledge of their capabilities would lead one to believe.\n\nHazard class: A classification for threats that boast enough power to destroy entire towns and require the movement of a nations knights to defeat. Equivalent to A Rank\nCalamity class: A classification for threats that could potentially bring down an entire country, usually possessing several high ranking Majin subordinates and boasting a considerable influence. Equivalent to Special A Rank\nDisaster class: A classification reserved for Demon Lords, beings who possess enough power and influence to rival a large country, requiring a powerhouse nation like Ingrassia to stand a chance against. The qualifications to be placed here are strict, with individuals of sufficient power often not being ranked here due to special factors and to not make the public think that Demon Lord level individuals are roaming the world freely unchecked. Equivalent to S Rank.\nCatastrophe class: A classification reserved for threats considered too great for any singular western nation to handle, requiring international cooperation beyond the framework of a nation to bet on a chance of survival. This level is officially only occupied by the True Dragons, but behind closed doors there are whispers of True Demon Lords who possess enough power to obliterate entire countries off the map. Equivalent to Special S Rank."
    },
    {
        "name": "Naming",
        "detail": "Naming refers to the act of an individual receiving a name. There are three known methods for this process.\nEqual Naming\nEqual Naming is an act of naming that establishes an equal relationship between the namer and the named. This type of naming either consumes no energy to perform or costs so little that it's considered \"safe\" and the power received in return can be considered minimal. Examples of this are parents naming their children or Veldora naming Rimuru Tempest.\nMaster Subordinate Naming\nMaster Subordinate naming is a type of naming that establishes the named as being subordinate to the namer. This act consumes an amount of energy – Magicules if the namer is a Majin or Life Force if the namer is Human or Demi Human – proportionate to the strength of the being receiving the name. If the namer names someone too strong or names too many people without a long enough recovery time, there is a high chance that the energy expended in the process of naming will never fully recover. The benefit to this rather risky process is the power that the named individual receives. Someone named in this way forms a powerful soul bond with the namer, possibly even inheriting some of their abilities, and in the case of monsters and certain regressed demi humans, they can even evolve.\nAdditionally, Rimuru developed a method that consumed the magicules in the surrounding environment in order to perform naming. This method obliterates the risk of naming to zero but, in return, the soul connection between the namer and named is significantly weaker than normal. Examples of this can be seen when Rimuru names 150,000 Orcs using the magicules still surrounding their body from the effects of Starved, and when Rimuru named the Black Numbers using the magicules contained within the culture pods that stored their bodies.\nNamed by the Masses\nOn extremely rare occasions an individual can receive a name through the collective belief of a large amount of people. Individuals named in this way receive all of the self image and power enhancing properties of a name but without the need of ever forming a close bond with another person. Examples of this type of naming can be seen with Guy Crimson and Orthos."
    },
    {
        "name": "Magic",
        "detail": "Magic that generates heat using flames as a medium.\nFire: The most basic technique within fire magics arsenal, it creates a palm sized ball of fire within the users hands. \nFire Lance: A projectile magic similar to Icicle Lance, it shoots a spear of fire that burns whatever it comes into contact with. \nFireball: Projectile AoE magic that shoots a ball of fire that incinerates everything near where it lands. \nFire Wall: Magic that raises a large pillar of fire within a specified area. \nFire Storm: High-level magic that creates a scorching storm of flames in a specified area. \nNapalm Burst: Magic that produces large projectiles shaped like dragons outwards from the user. This magic is unique in that its fire sticks to whatever it touches and burns away all the oxygen in the area just like a real fire, potentially suffocating the victim if the flames don't snuff them out first."
    },
    {
        "name": "Wind Magic",
        "detail": "Magic that generates and manipulates wind/air.\nWind Gust  Magic that generates a large gust of wind.\nWind Cutter   Projectile magic that cuts whatever it comes into contact with using a blade of wind. \nWind Protect   Magic that creates a protective veil of wind around the user. \nTornado Blade   Projectile AoE magic that can tear apart anything within a radius of where it lands. Under the right circumstances, it can kill over 3 people with one shot. \nAirflow Shut   Magic that prevents sound from traveling outside a specified range and normally used to hold private conversations.\nAir Shut   Magic that removes the air from a specified space. It's used for shutting down mages who are unable to perform magic without a chant.\nAir Buster   High-level magic that creates a continuous explosion using air pressure. Its lack of combustion and ability to be limited to a specific direction makes it perfect for enclosed spaces. Anyone capable of casting this magic can be called an Arank threat off of that feat alone."
    },
    {
        "name": "Water Magic",
        "detail": "Magic that generates and manipulates water of varying properties.\nWater Jail:  Magic that traps the target in a dome of water with spinning high pressure blades closing in on them as the dome shrinks. \nSleep Mist: Creates a mist that puts the target to sleep. \nAcid Shell:   Projectile magic that generates a large ball of acid. It melts anything it comes into contact with, even bones."
    },
    {
        "name": "Earth Magic",
        "detail": "Magic that manipulates the ground around the user.\nConjure Earth Wall:   Magic that creates a wall of stone from the ground. \nMud Hand: Magic that softens nearby earth into mud and uses it to hold the target in place. \nStone Shot: Magic that manipulates nearby rock and shoots it at the target as high velocity bullets.\nLiquidize: Magic that softens the earth, typically used to trap an opponent in a pitfall. \nEarth Lock: Magic that smooths out the terrain and creates even footing, can also be used in conjunction with Liquidize to trap opponents in the ground. \nMud Spears: Magic that fires spears made of hardened mud."
    },
    {
        "name": "Spatial Magic",
        "detail": "Magic that manipulates space for an extensive variety of uses such as storing objects and switching positions. Wounds created with spatial type magic cannot be healed by conventional means.\nWarp Portal: Magic that teleports the user to a specific location with a prepared magic circle. \nSpatial Storage: Magic that allows the user to store items within a subspace, similar to the \"stomach\" of Predator.\nDress Change: Magic that allows the user to instantly swap out their equipment with replacements inside spatial storage or similar without the need to undress."
    },
    {
        "name": "Light Magic",
        "detail": "Magic that generates light, usually to illuminate a specified area.\nLight: Magic that creates an orb of light that illuminates things in a small area.\nFloor Light: Magic that creates lights that illuminate things in a wide area.\nFlashbang: Magic that can seriously impair someone's hearing and eyesight with a blinding flash of light."
    },
    {
        "name": "Transportation Magic",
        "detail": "Magic used to transfer inorganic materials and supplies to a specified location at a low cost by linking the coordinates through a separate dimension."
    },
    {
        "name": "Gravity Magic",
        "detail": "Magic that increases or decreases the gravity on a specified object or area."
    },
    {
        "name": "Ice Magic",
        "detail": "Magic that \"saps heat\" using ice as a physical medium.\nIcicle Lance: A projectile magic carried within a spear of ice that freezes whatever it hits. \nIcicle Shot: An enhanced version of icicle lance that fires several spears outwards in several directions like a shotgun. \nIcicle Rain: An ultraenhanced version of icicle lance that fires a powerful bombardment of spears surpassing the output of icicle shot.\nIce Blizzard: High level magic that creates a freezing storm of ice in a specified area. \nIce Breaker: The strongest ice magic against a single target. The user freezes all the moisture in the atmosphere around the targeted space solid and then shatters it. \nCocytus: Strategic class magic meant for city extermination. It freezes a wide area, extending over a radius of potentially over 30 kilometers depending on the skill of the user. If the magic is focused solely on individuals, it can freeze even a greater fire elemental solid."
    },
    {
        "name": "Explosive Magic",
        "detail": "Magic that generates a shockwave at the desired area."
    },
    {
        "name": "Explosive Flame Magic",
        "detail": "Compound Magic that combines Explosion Magic with Fire Magic to devastating effect."
    },
    {
        "name": "Lightning Magic",
        "detail": "Magic that generates electrical forces.\nThunderbolt: Magic that chars the target to ash with a bolt of lightning from above. \nThunder Rain: Magic that causes a multitude of lightning strikes to fall in a specified area."
    },
    {
        "name": "Flight Magic",
        "detail": "Magic that enables the user to fly."
    },
    {
        "name": "Restoration Magic",
        "detail": "Magic capable of healing the user or others, similar to the healing spells in Holy Magic.\nAntidote: Magic that removes toxins and poisons.\nHeal: Magic capable of healing basic injuries."
    },
    {
        "name": "Life Magic",
        "detail": "Life magic, or Household Magic, is low level magic that focuses on effects on the human body useful in everyday life.\nClean Wash: Magic that cleans the body and removes odor.\nHealthcare: Magic that allows a certain degree of manual control over the bodies natural functions such as bowel movements and similar.\nInsect Repellent: Magic that repels insects."
    },
    {
        "name": "Preservation Magic: Magic that slows down the process of decomposition in organic material.\nOptical Magic",
        "detail": "Magic that can enlarge and distort images like with a lens.\nClairvoyance: Magic that enhances the users vision similar to looking through binoculars."
    },
    {
        "name": "Enhancement Magic",
        "detail": "Weakening Magic  Magic that \"debuffs\" the target. It's typically used to reduce a monsters physical strength.\nDrain Power: Magic that drains the physical strength of a target."
    },
    {
        "name": "Slowing Magic",
        "detail": "Magic that reduces the momentum of the target, usually used to halt a fast moving monster or object.\nReduce Speed: Magic that greatly reduces the momentum of an object or person, especially useful in dealing with high speed opponents."
    },
    {
        "name": "Creation Magic: Magic that allows the user to shape and create substances. It is commonly utilized to create weapons and clothing as well as golems.\nAnalysis Magic: Magic that allows the user to analyze the properties of the desired target.\nIllusion Magic",
        "detail": "Magic that makes use of magicules to interact with a target's mind and spirit, usually to confuse their senses.\nChanneling: Magic that allows the user to telepathically share ideas, similar to Thought Communication.\nCharm: Magic that induces desired thoughts in the target and brings them under the user's control.\nConfusion: Magic that interferes with a target's five senses and puts them to sleep.\nFlame Wall: Magic that creates a wall of illusory flames. It's useful for stopping an opponent in their tracks or as a smokescreen.\nMagic Sensor: Magic that allows the user to detect magical elements in the air, usually used in conjunction with Magic Sense.\nMental Crush: Magic that attacks the target's spiritual body directly, potentially resulting in an instant kill.\nThoughtography: Magic that allows the user to directly print images from their mind onto a surface such as paper."
    },
    {
        "name": "Mental Magic",
        "detail": "Magic that directly interferes with a target's mind and thoughts, causing fear, confusion or even outright controlling the target. It can be cast directly or take effect through an object as a medium.\nDemon Dominate: A domination magic that can put the mind and body under total control of the user.\nDemon Marionette: The ultimate domination magic utilized by Clayman, it's even capable of controlling disaster class opponents such as demon lords.\nLocking Curse: The controlling curse commonly placed on Otherworlders’ souls upon summoning. The victim cannot go against the user's commands and their freedom of movement can be taken away with just a word.\nMarionette Heart: A magic heartreplacing device that turns the receiver into a Majin. In return, the caster keeps the original heart of the receiver, allowing them to kill the target easily. Additionally, it emits encrypted information through electronic waves that allows the user full monitoring of the receiver without being noticed."
    },
    {
        "name": "Contract Magic: Magic that enforces the terms of a contract between two willing parties.\nBarrier Magic",
        "detail": "Magic that produces a barrier that can either prevent people or effects from passing through or enforce specific effects within the bounded field.\nAntiMagic Area: A barrier that completely prevents all casting of magic that rewrites the worlds laws inside the bounded field.\nBarrier: Creates a barrier around the user that can block incoming damage.\nMagic Barrier: Creates a barrier that covers a wide area to protect the caster and their comrades from incoming magic.\nAntiShock Area: A barrier that reduces up to 99% of all physical damage within its radius."
    },
    {
        "name": "Nuclear Magic",
        "detail": "Nuclear Magic is a magic that relies on the creation and manipulation of Abyss Cores ; incredibly dense balls of dark flames that are capable of interfering with spiritrons. When handled by humans it requires a large group of experienced casters to perform the spell in a ritual, and even then they can only perform the most basic spell of Nuclear Cannon. Some legendary champions such as Razen are capable of performing it solo so long as they have sufficient time to cast the spell or have it prepared in advance and high ranking Daemons are known to be able to fire off nuclear magic spells in rapid succession even in the heat of battle.\nNuclear Cannon: Fires a powerful heat ray straight ahead that can completely destroy the targets material body. This is one of the most powerful magics against a single target.\nNuclear Flame: Creates a thermonuclear explosion enveloping a large area.\nDeath Streak: Showers a wide area with deadly spiritron radiation that completely destroys the flesh and soul of all living beings, while leaving material objects intact.\nGravity Collapse: Creates a localized gravitational field disruption, resulting in an artificial blackhole. The black hole sucks everything into a single point and explodes outwards in something resembling a supernova. The barrier used to contain the blast extends upwards instead of outwards, creating a massive pillar that goes all the way out into space. This is the most destructive nuclear magic that encompasses all physical and magical phenomena, making it very hard to defend against.\nAbyss Annihilation: An ultra powerful technique that taps into Dark Magic to summon negative energy from the bottom of hell and mixes it into Gravity Collapse, creating a devastating attack that can even tear down entire dimensions."
    },
    {
        "name": "Legion Magic: Magic cast on large groups of people, it's usually used to apply buffs to an entire army.\nArmy Move: Complete Transfer Technique:\n}\nMiscellaneous Magic:\nUnknown Magic",
        "detail": "Compounding magic involves casting two or more magics from different \"schools\" of elemental magic to create a magic on a scale beyond either of the original two types, for example Fire Magic combined with Explosion Magic results in the Explosive Flames used by Erald and Shizu.\n\nWhen casting compound magic the aspects of the spell like launch speed, targeting accuracy, size and scope of the effect, and duration are in complete control of the casters whims, however, casting compound magic requires an intense amount of mental capacity that normal magicians are unable to handle. This type of magic is usually only allowed to be studied by master wizards for military purposes."
    },
    {
        "name": "Skills",
        "detail": "Skill is an ability that, on rare occasions, can be acquired in recognition of some form of personal growth. Its acquisition happens by having it inscribed onto the Soul or Body by the World Language or by other skills.\nThey are like formulas that, once etched onto the individual, can be instinctively used without any practice, though their efficiency and effective use require varying amounts of practice and hard work, depending on talent and compatibility with the user.\nAcquisition\nAn individual can gain Skills by using these five methods:\n1. By Birth or Evolution: Certain Races are born with Intrinsic Skills.\n2. By Proficiency: By achieving certain feats or by successfully using a skill without having it yet, the corresponding skill can be acquired directly by the individual in question.\n3. By Stealing from Others: Accessing the Body of an enemy breaking the Spiritual and Astral bodies of target like Razen does, or using skill theft specific skills like Gluttony, Usurper or Mammon, allows one to acquire the target's skills.\n4. By Voluntarily Granting Duplicates of Skills: Through naming or via certain skills like Gluttony or Beelzebuth, it's possible to share one's skills with others.\n5. By Combining and Evolving Skills: By using certain skills like Degenerate that can fuse skills, or by taking advantage of the Harvest Festival, it's possible to evolve skills into stronger ones.\nObtaining new skills has the downside of permanently lowering one's Magicule capacity each time a new Skill is acquired. The amount of Energy that is converted to form the Skill depends on the Skills power. The capacity of skills is based on the strength of the soul and body.\nIndividuals with a high Magicule capacity can gain skills more easily, while named individuals with stronger and more complete souls have a higher skill capacity.\nTypes\nIntrinsic Skills\nIntrinsic Skill refers to the innate Skills that certain Monster and Demi Human races possess. They are generally the same for the whole race, but Unique Monsters can be exceptions, and higher evolution stages likewise usually grant more skills.\nCommon Skills\nCommon Skill refers to the most common of skills, which are usually easy to acquire.\nExtra Skills\nExtra Skill refers to skills with power and efficiency magnitudes higher than those of Common Skills.\nUnique Skills\nUnique Skills are fundamentally different from the lower skills.\nThere are times when the mold of one's mind and its powerful wishes give shape to skills. This is the nature of what is referred to as a \"Unique Skill.\" The process to acquire one is impossible without a mighty Soul, but among such beings, some can even have two or three of them.\nA unique skill is the shape of the mind itself, meaning that those with a particularly weak ego have no chance to acquire one themselves. In most cases, unique skills possess sub skills in addition to their main ability.\nUltimate Skills\nUltimate Skills grant access to the ultimate principles of the world. The only way to combat an Ultimate Skill is to employ an Ultimate Skill as well. Just qualifying for an Ultimate Skill requires an extremely strong soul, will, and one to be a Spiritual Lifeform.\nLike with unique skills, most ultimate skills also have sub skills included and are unique to an Individual.\nResist Skills\nResist Skill refers to a type of skill that is generally passive and enables the user to withstand certain phenomena, both magical and physical. Among this type of skill are Resistance and Nullification the former granting a high tolerance while the latter outright negates certain phenomena.\nResistance type skills can be imbued into Barriers and Magic Equipment to amplify the Resistance type skills effects even further.\nMedical Skills\nMedical Skills are biotechnologically manufactured Skills."
    },
    {
        "name": "Intrinsic Skills",
        "detail": "Intrinsic Skills are Skills that are inherent to a certain Race's or individual's physiology. They usually take the form of Common Skills, Extra Skills, and Resist Skills but in rare instances Unique Skills or even the equivalent of Ultimate Skills are possible.\nKnown Species Specific Skills\nSpecies\n\tSkills\n\tArmorsaurus\n\tBody Armor\n\tBlack Spider\n\tSticky Thread\nSteel Thread\n\tDaemon\n\tMagic Resistance\nMaterial Creation\nSpirit Possession\n\tDeathman\n\tMagic Resistance\n\tDirewolf\n\tKeen Smell\nThought Communication\nCoercion\n\tDragonewt\n\tDragon Scales\nDragon Eye\nDragon Change\nDragon Body\nFlame Breath\nThunder Breath\nMagic Resistance\n\tDragonewt (True)\n\tMagic Sense\nUltra Sense\nDragon Skin\nFlame Breath\nThunder Breath\n\tDryad\n\tPlant Whisper\n\tEvil Centipede\n\tParalyzing Breath\n\tGiant Bat\n\tDrain\nUltrasonic Waves\n\tHarpy\n\tMagic Jamming\n\tIfrit\n\tFlame Transformation\n\tLycanthrope\n\tBeastialization\nBeast Transformation\nSelf Regeneration\n\tMegalodon\n\tMagic Jamming\n\tNight Stalker\n\tDark Night Cycle\nSteel Strength\nTransform\nUltraspeed Regeneration\n\tNinehead\n\tBeast Unification\n\tNinetail\n\tBeast Domination\nBeast Unification\n\tOni (Wicked)\n\tOgre Berserker\nPerfect Memory\nUltraspeed Regeneration\n\tOrc Lord\n\tStarved\n\tPhantom\n\tSpirit Possession\n\tSlime\n\tAbsorb\nDissolve\nSelf Regeneration\n\tStar Wolf\n\tKeen Smell\nThought Communication\nCoercion\nShadow Motion\n\tTempest Serpent\n\tPoisonous Breath\nSense Heat Source\n\tTempest Star Wolf\n\tKeen Smell\nThought Communication\nCoercion\nShadow Motion\nBlack Lightning\n\tTempest Wolf\n\tKeen Smell\nThought Communication\nCoercion\nShadow Motion\n\tTrue Dragon\n\tUniversal Sense\nUniversal Shapeshift\nDragon Spirit Haki\n\tTrue Giant\n\tMagic Nullification\n\tVampire\n\tBlood Raise\nCharm\nCoercion\nParalyze\nSelf Regeneration\nShadow Motion\nSteel Strength\nTransform\n\tKnown Individual Specific Skills\nSpecies\n\tSkills\n\tCharybdis\n\tMagic Jamming\nSummon Monster\nGravity Flight\n\tPippin\n\tSmall World (Imitation)\nSpecial Parallel Operation\n\tPrelix\n\tAbsolute Immortality\n\tRamiris\n\tSmall World\n\tRimuru Tempest (Demon Slime)\n\tBlack Flame Thunder\nDemon Lord's Haki\nEnhanced Body Double\nInfinite Regeneration\nMagic Manipulation\nMultilayer Barrier\nSpatial Motion\nUniversal Sense\nUniversal Shapeshift\nUniversal Thread\n\tSeven Angels of Origin\n\tAdministrative Authority\n\tShion\n\tInfinite Regeneration"
    },
    {
        "name": "Common Skill",
        "detail": "Common Skill refers to the most common and basic form of Skills. These Skills are relatively easy to acquire if you're a Monster.\nKnown Common Skills\n* Apply Poison/Paralysis/Rot\n* Body Armor\n* Coercion\n* Farsight\n* Gravity Field\n* Gravity Flight\n* Hydraulic Propulsion\n* Paralyzing Breath\n* Poisonous Breath\n* Rot\n* Scale Armor\n* Self Regeneration\n* Steel Thread\n* Sticky Thread\n* Strengthen\n* Super Vibration\n* Telepathy\n* Thought Communication\n* Ultrasonic Waves\n* Voice Cannon\n* Water Blade\n* Water Current Control"
    },
    {
        "name": "Extra Skill",
        "detail": "Extra Skill refers to Skills with power and efficiency magnitudes higher than those of Common Skills.\nThey can also exist as Intrinsic Skills or as Sub Skills of Unique and Ultimate Skills."
    },
    {
        "name": "Ultimate Skill",
        "detail": "Ultimate Skills are the successor to Unique Skills and the final evolutionary stage of Skills in general.\nCharacteristics\nUltimate Skills, as the name implies, grants its wielder the ultimate power to control the very laws of nature. The only ways to counter an Ultimate Skill are with another Ultimate Skill, God Grade Equipment or Divinity. That is the absolute, unbendable rule of the world.\nIf Unique Skills are born from one's individuality, Ultimate Skills are born when Unique Skills are brought past their limit. That is why no Ultimate Skill is identical. A strong will and Soul, as well as being a Spiritual Lifeform are necessary to awaken an Ultimate Skill. Similar to all Skills, a large amount of Energy is consumed and converted to awaken them.\nThrough certain methods, Ultimate abilities can be imparted to those who have not naturally awakened them. One of the requirement is that the recipient must be a Spiritual Lifeform to qualify for it.\nVariation\nThere are certain variations of Ultimate Skills based on how they are acquired, namely Ultimate Gifts and Ultimate Enchantments. Both are not naturally awakened by the individual like ordinary Ultimate Skills, but instead imparted to them with the Skills Skill Gifting or Michael. Ultimate Gifts are Ultimate Skills which are gifted via a Soul Corridor, while Ultimate Enchantments are Ultimate Skills given to those outside of it."
    },
    {
        "name": "Resist Skill",
        "detail": "Resist Skills  are a special category of Skill that give the user advantages when exposed to attacks of various different types of phenomena. They can be Intrinsic Skills or acquired by having a long time exposure to attacks of that type.\nTypes\nResist Skills come in two varieties, Resistance  and Nullification . Resistances grant the user an extraordinarily high tolerance towards attacks of their type while Nullifications make them outright ineffective no matter the intensity. The two flaws with Resist Skills are that certain abilities are capable of bypassing them and that Resist Skills for \"Holy Attacks\" and \"Demonic Attacks\" can only be obtained as Resistance, with Nullification being an impossibility.\nKnown Resist Skills\nResistance\n* Abnormal Condition Resistance \n* Cold Resistance \n* Corrosion Resistance \n* Electricity Resistance \n* Flame Attack Resistance \n* Heat Resistance \n* Holy Attack Resistance \n* Holy Demonic Attack Resistance \n* Magic Resistance \n* Natural Effects Resistance \n* Pain Resistance \n* Paralysis Resistance \n* Physical Attack Resistance \n* Pierce Resistance \n* Poison Resistance \n* Spiritual Attack Resistance \n* Thermal Fluctuation Resistance \n* Nullification\n* Abnormal Condition Nullification \n* Cold Nullification \n* Corrosion Nullification \n* Flame Attack Nullification \n* Heat Nullification \n* Magic Nullification \n* Natural Effects Nullification \n* Pain Nullification \n* Physical Attack Nullification \n* Poison Nullification \n* Spiritual Attack Nullification \n* Thermal Fluctuation Nullification\n\n* Some skilled individuals are able to weaken their Resist Skills. This is often used to lower their Poison Nullification to get drunk."
    },
    {
        "name": "Suphia",
        "detail": "Suphia, known as the White Tiger Claw, is one of Beast Kingdom Eurazania's Three Beastketeers. She is described as having a ferocious aura that has been likened to a \"battle-hardened leader.\"\n\nAppearance\nHuman\nShe has Cat-like eyes and shiny, long, white hair that is slick and straight. Her stature is very lean.\n\nTiger\nAs a tiger, she appears as a typical white tiger. It's commented that a Lycanthrope showing their Beast Form is considered \"quite brazen.\"\n\nPersonality\nAs hinted at in the description of her aura, she is extremely blunt and very forward. She also seems to look down upon humans. She enjoys fighting and even contests with Shion. She shows a fair amount of respect towards Albis after she stops her fight with Shion, suggesting she considers herself equal with Albis. She loves drinking alcohol.\n\nBiographical\nAlias / Epithet / Nickname: White Tiger Claw\nBiological\nSpecies: Lycanthrope (Tigerman)\nKind: Inhabitant\nGender:Female\nHair Color: White\nEye Color: Blue\nStatus: Alive\nSocial\nCountry of Residence: Beast Kingdom Eurazania\nClass: Brawler\nRank: Special A\nAffiliation: Three Beastketeers\n\nSkills\nExtra Skills:\n-Magic Sense\n\nIntrinsic Skills:\n-Beastialization (Tiger)\n-Beast Transformation (Tiger)\n-Self-Regeneration\n\nArts:\nLightning Aura: Allows the user to turn their aura into lightning and manipulate it."
    },
    {
        "name": "Albis",
        "detail": "Albis, known as the Golden Serpent, is one of Carrion's Beastman subordinates. She is the leader of Eurazania's Three Beastketeers.\n\nAppearance\nShe appears with a coldhearted stare and snake-like eyes, with black-gold hair.\n\nShe normally takes a human form, but when asserting her power, she takes an intermediate form between it and her full transformed state; with her legs replaced by a tail and horns growing from her head. Though this form also pops up when Albis gets drunk.\n\nWhen in full-battle form, she loses her formal clothing and is almost covered in scales; with her only clothing being a simple top. While her horns and tail are still a constant, her eyes take an extreme serpentine appearance.\n\nPersonality\nAlbis seems to be a very docile and reticent individual, coming off as 'easy-going' to Rimuru. She holds immense respect for Carrion, but that is only the case in peaceful situations. On the battlefield, Albis is even more ferocious than the other two members of the Three Beastketeers. She is a heavy drinker.\n\nAlias / Epithet / Nickname: Golden Snakehorn\n\nSpecies: Lycanthrope (Snakeman)\nKind: Inhabitant\nGender: Female\nHair Color: Black-Gold\nStatus: Alive\nRank: Special A\nAffiliations:\nBeast Kingdom Eurazania\nThree Beastketeers\n\nSkills:\n\nUnique Skill\nSuppressor:\n-Spatial Suppression - Puts the surrounding space under the user's control and disables other spatial abilities.\n-Spatial Motion - Allows the user to freely teleport to anywhere they've been previously.\n-Thought Acceleration\n\nIntrinsic Skill\n-Beastialization (Snake)\n-Beast Transformation (Snake)\n-Self-Regeneration\n\nArts:\n-Lightning Aura: Allows the user to turn their aura into lightning and manipulate it.\n\nExtra Skills\n-Snake Eye: Applies all manner of status ailments on foes within vision such as paralysis, poison, insanity, petrification and others.\n\nEquipment\nGolden Staff:\nUnknown Grade Weapon\nAlbis can merge with her staff in order to further boost her power during beast transformation dramatically, during this time the weapon manifests itself as a horn on her forehead."
    },
    {
        "name": "Three Beastketeers",
        "detail": "Three Beastketeers refers to the three Beastmen Albis, Suphia, and Phobio who within Beast Kingdom Eurazania are second only to the Ex-Demon Lord Carrion himself.\n\nSocial Influence\nThey are highly respected in Eurazania and after Carrion's temporary disappearance, they held enough sway among the beastmen to get the army to agree with fighting under the command of Tempest's Benimaru against Clayman's forces.\n\nStructure\nAs Eurazania is a meritocratic nation, the positions of the current Three Beastketeers aren't guaranteed. If someone stronger appears among the beastmen that desires one of the three positions, then the current members will have to oblige the challenge and will be replaced from their position if they lost.\n\nLeaders:\nCarrion\nAlbis\n\nMembers:\nAlbis\nSuphia\nPhobio"
    },
    {
        "name": "Diablo:\nPrimordial Black:\nNoir",
        "detail": "Diablo, also known as Noir is one of the seven Primordial Daemons and an Executive of the Jura Tempest Federation, serving as a secretary and Butler to Rimuru Tempest. He is the leader of the Black Numbers and is Rimuru's most powerful subordinate among the Twelve Guardian Lords and the Three Top.\n\nAppearance\nBlack hair with streaks of red and gold, as well as golden eyes with red pupils and black sclerae, Noir was finely dressed in garments like that of a prince. Other than that, he looked like a normal human, though he was able to unfold wings as well.\n\nDaemon Lord\nDiablo's change in appearance is possibly the least drastic after any evolution, with only his princely garments being replaced by a Butler outfit, reflecting his wish to serve Rimuru. Despite that, however, his dignity did not decrease, but rather increased instead.\n\nPersonality\nDiablo is whimsical but also very calculative when he wants to be. He usually displays an absolutely composed attitude, but whenever anyone insults Rimuru, his polite exterior turns into one of cold malice as he proceeds to punish the \"sinner\" in the most excruciating way imaginable, unless it goes against Rimuru's orders. However, when one has a good relationship with Rimuru, Diablo usually treats them in an amiable way, though that does not mean he won't manipulate them for his own ends, \"his own ends\" usually referring to being close to Rimuru more often.\n\nDiablo follows Rimuru's orders down to the letter. When tasked with increasing the difficulty of Framea's test as a guard for guests to Tempest, Diablo had summoned a moderately strong monster. Upon seeing Framea's will to fight despite being paralyzed by the creature's goo, Diablo sent the creature away and returned to report back on her actions. Should there be any \"grey areas\" in his instructions, Diablo has the freedom to carry out his orders how he sees fit.\n\nThe greatest show of Diablo's loyalty to Rimuru was recruiting hundreds of other daemons, including the last three Primordials, to serve his master; the creation of the Black Numbers, who became the de facto strongest fighting force in Tempest.\n\nDiablo also despises owing a debt, even to someone who has already passed on. Shizu's replacement, Tiss attempted a desperate summon to save Shizu's Students from a Phantom, only for the unnamed Diablo to offer his aid for what was practically a pittance of a price by forbidding her from mentioning his involvement, and proceeded to slaughter the aggressor in a truly horrific fashion, thus fulfilling his debt.\n\nBackground\nThought of as strange by the other Primordials, Noir only acted on his whims and very rarely showed any regular behavior, to the irritation of some of the other Primordials. Due to that, he one day stopped pursuing power as his power efficiency became so high that any fights were too easy for him, causing him to remain as an Arch Daemon despite having enough power to evolve into a Daemon Lord already.\n\nOne day when he personally answered a Demon Summon of the Silver Wings on a whim, he had a chance encounter with Shizue Izawa. During a confrontation where Noir was about to finish her off, he was repelled by Shizue's Anti-Magic Mask instead, making Noir realize that the mask had an incomprehensible nature. After those events, he returned to the Spiritual World and continued observing Shizue and the mask in secret. When he saw that the mask broke and lost its power when the mask came into Rimuru's hands, Noir came to the conclusion that Rimuru is connected to that power of the mask that surpasses time itself as he witnessed and that Rimuru is, therefore, the key to the \"truth of the world.\"\n\nHe tried to get summoned when Rimuru performed a Greater Daemon Summoning within The Dungeon. He failed because Beretta, his own descendant, answered the summon first much to his chagrin.\n\nFinally, when Rimuru did another Greater Daemon Summoning to catch the hiding Razen, Noir managed to answer the call alongside two of his Greater Daemon followers. After some further events, Noir finally received the name \"Diablo\" from Rimuru and evolved into a Daemon Lord."
    },
    {
        "name": "Majin",
        "detail": "Majin , also known as Magic born, is a catchall term for intelligent Monsters. They can be born naturally, be the result of monsters that have undergone mutation, or evolved from already intelligent non magical beings that have undergone monsterization.\n\nMost Majin have reproductive ability, but usually only within their own subspecies. In their upper social castes exist Greater Majin such as Giants, Vampires, Harpies and other longer lived species all equally capable of having offspring, although they rarely do so, since their immense Magic Power causes them to be nigh immortal, obviating the need to leave descendants.\n\nDemonoid:\nDemonoid  is a generalized term used to refer to Majin who were originally Humans, but have had their body mutated by magic to become monsters.\n\nStrength Classifications\nGreater Majin:\nGreater Majin  is a general term used for Majin who are Over A Rank. They hold power unimaginable to a normal person, usually being found in service to one Demon Lord or another as apart of their elite troops. In some areas, they are even worshipped as Local Gods.\n\nExamples include Gelmud before their naming spree and Geld in their Orc Lord state.\n\nSub Demon Lord Level:\nSub Demon Lord Level  is a general term given to Majin who have surpassed simple Greater Majin in power and reached Special A Rank. Although their strength is still a far cry from Demon Lord Level, they're powerful pawns for the Demon Lords, with them usually taking thorough preparations in order to either take them down or bring them to their side. For Majin of this level it isn't strange for them to have powerful minions in the form of Greater Majin and Greater Daemons assisting them in their schemes, allowing them to potentially take down an entire nation with thorough preparation.\n\nExamples include the Orc Disaster Geld and the Three Beastketeers prior to receiving gifts from Carrion's Harvest Festival.\n\nDemon Lord Level:\nDemon Lord Level  is a term used to refer to Majin that have strength comparable to a Demon Lord but aren't themselves officially recognized Demon Lords. Majin of this level usually have one or more Sub Demon Lord Level subordinates and dozens of Greater Majin under their control. It isn't unusual to find them in control of a large area of land comparable to a small nation.\n\nExamples include Charybdis and Rimuru Tempest prior to undergoing the Harvest Festival and joining the Octagram.\n\nKnown Species:\nMajin\nBorn\nArch Doll\nBaki\nChaos Doll\nChaos Metalloid\nDaemon\nDeathman\nDemon Slime\nDragon Lord\nDragon Majin\nDragonoid\nGiant\nGozu\nGyuuki\nHarpy\nHigh Blood\nInsectar\nMezu\nNight Stalker\nNinetail\nServant\nStar Wasp\nTreant\nTrue Dragon\nTrue Giant\nVampire\nMonsterization\nDeath Oni\nDemonoid\nFallen\nFlame Lord\nOni \nOrc Disaster\nPhantom\n\nDisaster Rank\nB ~ Special S"

    },
    {
        "name": "Rimuru's Skills",
        "detail": "Azathoth:\nUnification of Raphael and Beelzebuth.\n* Soul Gluttony - A super enhanced version of predation gluttony, which can devour the target's soul ignoring space time.\n* Imaginary Collapse - The ultimate destructive energy that fills the chaotic Imaginary Space and is able to be used at full efficiency with the assistance of Ciel.\n* Imaginary Space - A world of chaos. The ultra evolved version of \"Stomach\" and \"Isolation\" with unlimited size. It's a prison where those who need to be quarantined are locked up.\n* Space Time Domination - Manipulating and bending time and space to the users will, being able to move in an instant just by consciously thinking about it. Even allows the user to interfere with Time.\n* Multi Dimensional Barrier - Absolute Defense is achieved through the combination of Dimension Fault and an always active Multi layer barrier, boasting performance above that of Uriel's Absolute Guard.\n* True Dragon Release [Scorch・Storm] - A variant of Parallel Existence that allows for Veldora and Velgrynd, as well as their power, to exist simultaneously assimilated with Rimuru and active in the outside world. When activated, an “other body” of Veldora or Velgrynd is created and all of Rimuru’s energy that would have otherwise belonged to them is loaned back. It can be undone with the respective dragon’s consent and after doing so all of their energy will return to Rimuru.\n* True Dragon Nucleation [Scorch・Storm] -\n   * If Veldora and/or Velgrynds energy is not currently lent by True Dragon Release, it can instead be materialized into the form of a spherical core. The core contains all of their energy as if it were their body and can be slotted into Rimuru’s sword, creating an unmatched weapon.\nShub Niggurath\nCore or Essence of Uriel Merged with all the skills gained via food chain.\n* Skill Creation - Allows the user to create brand new skills based on the information obtained from analysis and the user's desires.\n* Skill Duplication - Allows the user to recreate skills that they have a full analysis of.\n* Skill Gifting - Allows the user to grant skills to a target, assuming they're compatible.\n* Skill Storage - Stores the information of all analyzed skills so they can be recreated later.\nRaphael:\nMerged with Beelzebuth to create Azathoth.\n* Thought Acceleration - Lets user extends their thoughts by up to a million times.\n* Analytical Appraisal - Analyzes and assesses the target.\n* Parallel Processing - Operates on any matter the user wishes to analyze, separating it from the regular thought process. Any process under Parallel Processing is affected by Mind Accelerate and therefore sped up by a million times.\n* Chant Annulment - Removes the need for a chant when using Magic.\n* All of Creation - Allows the user to fully comprehend any non concealed phenomenon as long as they have a certain amount of knowledge beforehand.\n* Synthesize/Separate - The ability to fuse and separate.\n* Alteration - Allows the user to modify or even evolve skills under the right circumstances.\n* Future Attack Prediction - Allows the user to see from a series of outcomes what is going to happen. (The results that have been calculated have a 100% chance of occurring).\nBeelzebuth:\nMerged with Raphael to create Azathoth.\n* Predation - Absorbs the target into the user's body. The chance of success is lowered if the target has a consciousness of any kind. \"Predation\" can be used on organic, inorganic, and non physical objects (e.g. spiritual life forms like Elementals and Daemons), as well as Skills, Magic, Aura, and any projectile type attacks of the aforementioned categories, as well as magicules themselves. Compared to its Unique Skill counterpart: \"Gluttony\", it has been improved and can now ignore space and time to consume anything in the user's perception.\n* Stomach - Stores the predated target. It can also store materials created via Analysis. Items stored in the user's stomach are unaffected by time. Its space is roughly 10x that of Gluttony’s.\n* Mimicry - Allows Rimuru to reproduce the form of analyzed targets with strength comparable to the original. Only available once the target has been fully Analyzed. Originally most intrinsic Skills gained from a predated species could only be used at full capacity by taking the form of said species, but Universal Shapeshift negates that issue.\n* Isolation - Stores harmful effects that are incapable of being analyzed, neutralizing them and breaking them down into magicules.\n* Rot - Inflicts \"Rot\" on the target, decomposing it if it is organic. Monster corpses partially absorbed in this manner will reward the user with part of the monster's skills. This effect is imbued into Predation.\n* Soul Consume - The ability to seize the souls of anyone begging for their lives, seeking help from the user, retreating, or running away. Once the condition is met, the soul can be seized at any time afterward, from virtually any distance instantly. The user can be informed about any malicious thoughts by the target immediately. The souls of the recently killed can also be seized.\n* Food Chain - Derived from \"Receive\" and \"Provide\". An ability that allows the user's subordinates to provide their strength to increase their own. They may also divert some of their strength down to them. \"Food Chain\" also grants access to the skills of those connected to the user.\nUriel\nThe combined state of all the abilities received from \"Food Chain\" after the Harvest Festival, using the space manipulating Infinity Prison as a base.\n* Spatial Domination - The enhanced version of Spatial Manipulation that allows the user to, among other things, Teleport instantly with little to no delay, to a place the user has coordinates of as well as lock the local space around the user to prevent space from being manipulated.\n* Universal Barrier - Provides absolute defense with a multilayer barrier and the severing of space between each layer.\n* Infinity Prison - Traps the target in an imaginary space for all time.\n* Law Manipulation - Black Fire and Thunder. Total magical control. Total control of the properties of heat and inertia. The ability to freely store and remove heat from the Stomach. It is also capable of altering reality. Rimuru's version of this ability allows him to use the skills he obtained via Food Chain.\nVeldora:\nGained after Beelzebuth ate Veldora's remains inside the stomach and later integrated into Azathoth.\n* Summon Storm Dragon: - An ability that can summon Veldora across space time.\n* Restore Storm Dragon - An ability that copies Veldora's memories into the user's mind through soul corridor. In other words, if Veldora dies for some reason, he can replace him or, to put it another way, the “real” Veldora would reside within the user's soul.\n* Storm Magic - Allows the user to access Storm Magic.\nUnique Skills\n\nWise One:\nEvolved into Raphael.\n* Thought Acceleration - Boosts thought speed by a thousand times.\n* Analytical Appraisal - Analyzes and assesses the target.\n* Parallel Processing - Operates on any matter the user wishes to analyze, separating it from the regular thought process. Any process under Parallel Processing is affected by Hasten Thought and accelerated by a thousand times.\n* Chant Annulment - Annuls the casting period required when using Magic, etc.\n* All of Creation - Allows the user to fully comprehend any non concealed phenomenon as long as they have a certain amount of knowledge beforehand.\nGluttony:\nEvolved into Beelzebuth.\n* Predation - Absorbs the target into the user's body. The chance of success is lowered if the target has a consciousness of any kind. \"Predation\" can be used on organic, inorganic, and non physical objects (e.g. spiritual life forms like Elementals and Daemons), as well as Skills, Magic, Aura, and any projectile type attacks of the aforementioned categories, as well as magicules themselves.\n* Stomach - Stores the predated target. It can also store materials created via Analysis. Items stored in the user's stomach are unaffected by time. Its space is roughly 10 times that of Predator's.\n* Mimicry - Allows Rimuru to reproduce the form of analyzed targets with strength comparable to the original. Only available once the target has been fully Analyzed. Originally most intrinsic Skills gained from a predated species could only be used at full capacity by taking the form of said species, but Universal Shapeshift negates that issue.\n* Isolation - Stores harmful effects that are incapable of being analyzed, neutralizing them and breaking them down into magicules.\n* Rot - Inflicts \"Rot\" on the target, decomposing it if it is organic. Monster corpses partially absorbed in this manner will reward the user with part of the monster's skills. This effect is imbued by Predation.\n* Receive - Gain the ability to obtain Skills from monsters under the user's influence. The original owner of the received Skill will not lose the Skill because of that.\n* Provide - Grants part of the user's abilities to monsters under the user's influence or linked to the user's soul. It can only provide Skills that the target is compatible with.\nDevourer:\nEvolved into Gluttony.\n* Predation - Absorbs the target into the user's body. The chance of success is lowered if the target has a consciousness of any kind. \"Predation\" can be used on organic, inorganic, and non physical objects (e.g. spiritual life forms like Elementals and Daemons), as well as Skills, Magic, Aura, and any projectile type attacks of the aforementioned categories, as well as magicules themselves.\n* Stomach - Stores the predated target. It can also store materials created via Analysis. Items stored in the user's stomach are unaffected by time. Its space is roughly 41,888 m3.\n* Analysis: Analyzes and researches targets taken into the user's body. Lets the user create craftable items. If the required materials are present, a copy of the item can be made. Successful Analysis of the casting method allows the user to learn the target's Skills and Magic.\n* Mimicry - Allows Rimuru to reproduce the form of analyzed targets with strength comparable to the original. Only available once the target has been fully Analyzed. Originally most intrinsic Skills gained from a predated species could only be used at full capacity by taking the form of said species, but Universal Shapeshift negates that issue.\n* Isolation - Stores harmful effects that are incapable of being analyzed, neutralizing them and breaking them down into magicules.\nHeartless:\nSacrificed and Integrated into Beelzebuth.\n* The ability to seize the souls of anyone begging for their lives, seeking help from the user, retreating, or running away. Once the condition is met, the soul can be seized at any time afterward across even very long distances instantly, and the user can be informed about any malicious thoughts by the target immediately. The souls of the recently killed can also be seized.\nShapeshifter\nSacrificed and Integrated into Raphael.\n* Synthesis - Transform two differing targets into a single object. Can be used to merge Skills together, evolving them into new skills. More than one Skill can be acquired from the merging depending on the combination used.\n* Separation - Release the properties inherent to the target and make it into a separate object. (The original object may disappear if it has no physical form).\nIntrinsic Skills\nUltimate Slime:\n* Dragon Spirit Haki:\n   * Powerful Haki that imbues the user's aura with magical and physical properties and shreds anything it comes into contact with.\n* Universal Sense:\n   * Allows the user to perceive almost all sensations including but not limited to, Light, Sound, Smell, and Heat in a wide radius.\n* Universal Shapeshift:\n   * Allows the user to freely change their body’s properties and disguise their appearance.\nDemon Slime:\n* Infinite Regeneration:\n   * As long as the user's core is intact and they have sufficient energy, they can completely regenerate from all damage.\n* Multilayer Barrier: (Absorbed into Uriel)\n   * Allows the user to keep several magical barriers imbued with each of their resistances up at all times for very little cost and effort. Each layer protects against a certain type of damage and when damage is absorbed, an appropriate amount of magicules is expended in turn.\n* Universal Sense:\n   * Allows the user to perceive almost all sensations including but not limited to, Light, Sound, Smell, and Heat in a wide radius.\n* Universal Shapeshift:\n   * Allows the user to freely change their body's properties and disguise their appearance.\n* Universal Thread:\n   * Enhanced version of Sticky Steel Thread\n* Enhanced Body Double:\n   * A more durable version of Replication. Capable of being used as an incarnation medium for True Dragons.\n* Demon Lord's Haki:\n   * A skill that enhances a magic based creature's Aura with magic and bends lesser beings to their will.\n* Spatial Motion (Absorbed into Spatial Domination of Uriel)\n   * Allows the user the ability to freely connect two spaces provided they have been there before.\n* Magic Manipulation (Absorbed into Law Manipulation of Uriel)\n* Black Flame Thunder (Absorbed into Law Manipulation of Uriel)\n   * Combined and enhanced version of Black Flames and Black Thunder\nSlime:\n* Self Regeneration: (Evolved into Ultraspeed Regeneration)\n   * Allows the user to regenerate from physical damage.\n* Absorb: (Absorbed into Predator)\n   * Allows the user to absorb a target into their body.\n* Dissolve: (Absorbed into Predator)\n   * Allows the user to dissolve targets that are captured with Absorb.\nRimuru's Extra Skills:\nSpatial Motion (Absorbed into Spatial Domination of Uriel)\n* Allows the user the ability to freely connect two spaces provided they have been there before.\nBlack Flame (Evolved into Black Flame Lightning)\n* Allows the user to freely manipulate black flames made of their internal magical energy. In the right hands, the flames can reach several hundred million degrees Celsius.\nBlack Thunder (Evolved into Black Flame Lightning)\n* Allows the user to freely manipulate powerful Black Lightning.\nMagic Aura\n* Allows the user to imbue magical properties into their Aura to combine Arts and Magic.\nGravity Manipulation (Absorbed into Law Manipulation of Uriel)\n* Allows the user to manipulate naturally existing gravity waves.\nMolecular Manipulation (Evolved into Magic Manipulation)\n* Allows the user the ability to manipulate virtually all physical matter via magicules.\nBody Double (Evolved into Enhanced Body Double)\n* Allows the user to create remote controlled clones of themselves out of magic. The clones have the same strength and skills (Except Unique and Ultimate Skills) as the user, But they are significantly less durable and only have the amount of magicules supplied to them upon creation.\nMagic Jamming (Evolved into Magic Manipulation)\n* Allows the user the ability to disrupt the motion of magicules in an extremely large area and makes using magicule based abilities much for difficult for anyone other than the user.\nMagic Manipulation (Absorbed into Law Manipulation of Uriel)\n* Allows the user the ability to directly interfere with someone else's magicules and disrupt their abilities and also dramatically improve the user's precision in manipulating magicules.\nShadow Motion (Absorbed into Spatial Motion)\n* Allows the user the ability to travel long distances by making use of the shadow sub space.\nSticky Steel Thread (Evolved into Universal Threads)\n* Durable threads made out of the user's own body.\nSteel Strength\n* Increases the physical strength of the user greatly.\nStrengthen Body\n* Enhances all of the body's physical aspects.\nRanged Barrier\n* Allows the user to create a barrier in any shape they specify within range.\nMagic Sense (Absorbed into Universal Sense)\n* Allows the user to observe the interactions between magicules and the matter around them to create a mental image of their surroundings.\nSense Soundwaves (Absorbed into Universal Sense)\n* Allows the user to directly sense sound waves and hear even while deafened.\nSense Heat Source (Absorbed into Universal Sense)\n* Allows the user to sense the heat radiating off living beings. Similar to infrared vision.\nKeen Smell (Absorbed into Universal Sense)\n* Enhances the user's sense of smell greatly.\nCommon Skills\n\nTelepathy\n* Allows the user to communicate mentally.\nThought Communication\n* A stronger version of Telepathy that allows the user to directly share their thoughts and experiences with the target(s). Its effective range is about 1 km.\nPoisonous Breath\n* Allows the user to unleash a corrosive poison breath attack.\nParalyzing Breath\n* Allows the user to unleash a paralyzing breath attack.\nBody Armor\n* Allows the user to form a scaly armor around their entire body (or selectively) which is harder than steel.\nUltrasonic Waves\n* Allows the user to manipulate ultrasonic waves both as a weapon and for auditory communication.\nResist Skills\n\n* Physical Attack Nullification\n* Natural Effects Nullification\n* Abnormal Condition Nullification\n* Spiritual Attack Nullification\n* Holy Demonic Attack Resistance\nRimuru's Equipment:\n* Drago Blade \n   * God Grade Sword\n   * Kurobe's Masterpiece. It has no special abilities in exchange for being exceptionally durable.\n* Black Robe\n   * God Grade Armor\n   * Material Creation\n* Anti Magic Mask\n   * Magic Item\n   * Suppresses Magicules.\n* Demon's Ring\nRimuru's Arts:\nRimuru's Magic:\nTrue Dragon Species Magic (Unnamed)\n* Imaginary Blade\nStorm Magic\n* Death Calling Wind\n* Storm of Destruction\n* Black Lightning\n* Black Fire\n* Storm Blast\nRimuru's Elemental Magic:\n* Nuclear Strike Magic\n* Legion Magic\n   * Completed Transportation Technique\n* Barrier Magic\n   * Anti Magic Area\n   * Space Expansion Barrier\n* Mental Magic\n* Illusion Magic\n   * Confusion\n   * Channeling\n   * Thoughtography\n* Magic Communication\n* Engraving Magic\n* Spatial Magic\n   * Dress Change\n   * Warp Portal\n   * Transportation\n* Fire Magic\n   * Fire\n   * Fireball\n   * Fire Wall\n   * Fire Storm\n* Explosion Magic\n* Explosive Fire Magic\n   * Explosive Flames\n   * Super High Explosive Flames\n* Wind Magic\n   * Wind Cutter\n   * Tornado Blade\n* Water Magic\n* Ice Magic\n   * Icicle Lance\n   * Icicle Shot\n* Earth Magic\nRimuru's Spiritual Magic:\n* Spirit Communication\n* Secret Art of Revival\n* Arcane Soul Recall\n* Secret of Faith and Grace\n* Space Spirit Magic\n* Fire Spirit Magic\n* Wind Spirit Magic\n* Water Spirit Magic\n* Earth Spirit Magic\n* Necromancy\nRimuru's Summoning Magic:\nDaemon Summoning Magic\n* Daemon Summoning Gate\n* Summon Greater Daemon\n* Summon Lesser Daemon\nElemental Summoning Magic\n* Summon Greater Fire Elemental: Ifrit\n* Summon Medium Space Elemental\n* Summon Medium Fire Elemental: Salamander\n* Summon Medium Wind Elemental\n* Summon Medium Water Elemental\n* Summon Medium Earth Elemental: Beast Gnome\n* Summon Lesser Space Elemental\n* Summon Lesser Fire Elemental\n* Summon Lesser Wind Elemental\n* Summon Lesser Water Elemental\n* Summon Lesser Earth Elemental\nRimuru's Holy Magic:\nBasic\n* Holy Cannon: | A focused beam of holy energy that rapidly purifies the magicules of a target. While a holy being or a being without magicules would simply be pushed by the shockwave, it's a surefire technique for killing monsters.\n* Holy Bell: | A wide range wave of holy energy surges from the user, purifying a large amount of magicules, and destroying any lesser monsters.\n* Holy Field: | Usually maintained by several magicians working in tandem, within the radius of the barrier purification of all magicules commences. Lesser monsters are killed instantly, and any higher magical being is severely weakened. The barrier is even capable of preventing the use of regular magic and sealing the use of most skills.\n* Prison Field: - A much weaker version of Holy Field that weakens all monsters over a vast area and prevents escape.\n* Heal Ailments/Recovery: | By utilizing holy energy, wounds and diseases can be cured instantly, and at higher levels, even entire limbs and organs can be regenerated.\nMiracle\n* Disintegration: | In a process similar to nuclear decay, spiritrons bombard the target and destroy them on a molecular level.\n* Holy Ray: | A large beam or ray of spiritrons shoots out from the user, bypassing all barriers and destroying the target.\n* Resurrection: | By utilizing spiritrons, the user is able to heal any wound and even bring back the recently deceased.\nRimuru's Physics Magic:\nMegiddo:\n   * A Physically driven which uses Spirit to form multiple, very large magnifying glass water constructs in the air, which are actually lesser water spirits transformed to suit the user's needs. This focuses the energy of the sun into a devastating heat beam capable of reaching thousands of degrees. The constructs disintegrate after use, but the energy needed to replace and maintain them is very little. Because they are clear, thin lenses of suspended water, the constructs are almost impossible to see. The size and number of lenses can be changed to varying effects: decimating 1000 armored soldiers in a single shot to killing a single target instantly and without sound. By gathering water droplets from the water vapor in the atmosphere, in the shape of convex lenses in the sky, Rimuru condenses sunlight to the point where it becomes a massive laser beam, similar to using a magnifying glass. The skill has low requirements; the water droplets can continually be replaced when they evaporate. The massive energy beam is a physical phenomenon, and therefore cannot be blocked by magic disrupting barriers.\nBattlewill\n* Aura Slash : One of the most basic but also most deadly attacks within battlewill’s arsenal. The user launches their aura outwards from their weapon as a projectile.\n* Aura Sword : The user coats their weapon in aura using modelwill, this boosts the weapon's durability and damage potential drastically.\n* Formhide : Allows the user to hide their presence and form.\n   * Haze : Formhide pushed to it's absolute limit. The Art works in stages, First, you rid yourself of any sound, then wipe away any smell and disguise your temperature, before finally wiping away your aura and spirit. The end result makes the user undetectable even to things such as Magic Sense. The only way to counter is pure intuition.\n* Instantmove : Allows the user to rapidly increase their speed for a single movement, allowing for an almost teleportation like effect visually.\n* Magic Bullet : The user gathers their aura and surrounding magicules to form a dense ball of energy before firing at their target. One of the most basic arts but extremely versatile and scales to the user's power.\n* Modelwill : A fundamental technique that allows the user to create constructs out of their aura. They can also create bubbles able to encase objects, magic, or the effects of skills within.\nHazy Style\n* Myriad Variety Petals\nMystic Arts\n* Storm Break - Rimuru combines Veldora's Storm Magic with Arts to coat a sword in devastating magic. It is based on Hinata's Melt Slash and although the force behind it is much less, the powerful secondary effects make it just as deadly.\n* Melt Slash - The user combines magic and arts by applying Disintegration to their sword and launching themselves at the opponent at immense speeds.\nOther\n* Absolute Guard\n   * Absolute End - A devastating attack that cuts through space itself, achieved by inverting Absolute Guard.\n* Flare Circle\n* Hell Flare\n* Magic Flame Bullet\nOther Abilities\n* Master Swordsman - Rimuru is a master swordsman trained by Hakurou and further refined in the fight with Hinata. Rimuru was able to completely overwhelm Yuuki Kagurazaka with pure skill. Rimuru's weapon of choice is a Katana.\n* Great Sage/Raphael Prevents Rimuru's deep psyche from being interfered with, which blocks attempts to read their mind or memories even by beings such as True Dragons.\n* Special Soul - It has been stated that Rimuru's soul is extraordinarily strong on several occasions (This being the entire reason the Primordial Daemons follow him), And according to Veldora, Rimuru is the only person to have ever reincarnated across worlds into a fully magic body while also retaining all of their memories.\nCiel:\nIn the events of Game's End, Ciel obtained a significant amount of skills that would've otherwise been in Rimuru's possession in order to increase their reaction time when using them in emergency situations. Due to the complete integration of their cores, Rimuru can still access and use these skills at will without having to create new copies.\n* All of Creation\n* Analytical Appraisal\n* Attribute Conversion\n* Chant Annulment\n* Food Chain\n* Law Domination\n* Parallel Processing\n* Thought Domination\n* Synthesize/Separate\n* Thought Acceleration\nSubordinates Skills\nSkills gained via Food Chain and Skill Storage.\nUnique Skills\n* Cook - Shion\n* Divine Berserker - Shion\n* Commander - Benimaru\n* Shadow Striker - Souei\n* Analyst - Shuna\n* Manufacturer - Shuna\n* Martial Master - Hakurou\n* Godly Craftsman - Kurobe\n* Magic Wolf King - Ranga\n* Magic Wolf Summon - Gobta\n* Tuner - Gabiru\n* Guardian - Geld\n* Gourmet - Geld\n* Tempter - Diablo\n* Reverser - Beretta\nExtra Skills\n* Ultra Instinct\n* Thought Domination\n* Holy Demonic Reversal\n* Observing Eye\n* All Seeing Eye\n* Heavenly Eye\n* Flame Domination\n* Magic Flame Transformation\n* Identify Armor\nPerfect Memory"
    },
    {
        "name": "Clayman",
        "detail": "Clayman, known as Marionette Master, was a Demon Lord, in the era of the Ten Great Demon Lords. Being a Demon Lord Seed, he lacked some power in comparison to older generations of Demon Lords. He was considered a ghastly man, infamous for his acts of manipulating his subordinates and others like dolls.\n\nAppearance\nClayman had the appearance of a wealthy noble. He had a slim, oblong head topped with pale lavender hair; a face with a sharp chin and defined jawlines, and a pair of pointed ears on either side and thin eyebrows. He sported a slender figure, and his eyes with red irises exuded intelligence even as they suggested he was rather high strung.\nClayman wore expensive and elegant clothes sharing an overall white motif – a long white tailcoat, grey vest, white shirt, slim white trousers and white shoes, alongside black bow tie. In his inner pocket of his tailcoat, he kept a gold plated pocket watch with an engraving on its lid, the chain of which could be seen.\nIn his combat form, his skin was darker, his entire figure changed - four more prosthetic arms and a tail emerged. In place of his elegant tuxedo was a wrought iron breastplate, codpiece, and spiked pauldrons and armor for his legs. When he donned his mask and acted as the \"Crazed Clown,\" he seemed more like a mad beast instead.\nAfter his Pseudo Awakening following him being severely wounded by Shion, his appearance drastically changes. In this form, his dismembered arms are replaced by arms made of energy in purple color, with the upper additional pair of arms being large and long while the lower pair of arms being longer in length. His eyes also glow with a flaming aura.\nPersonality\nClayman was a cunning and manipulative Demon Lord, who preferred to operate from the shadows rather than engage in direct conflict himself. His expertise lay in intelligence gathering, utilizing his abilities to perfect his schemes and gain more power.\nIn his interactions with subordinates and those he considered beneath him, Clayman displayed a disdainful and abusive attitude. He discarded individuals who were no longer useful to him and coerced others into submission using his Unique Skill. His force of will was so strong that he could make almost anyone follow his orders.\nFurthermore, Clayman was known for his stubbornness and pride. He refused to acknowledge his mistakes, even when confronted with evidence of his involvement in various plots. Most Demon Lords were already aware of his conspiracy to become a True Demon Lord, yet he remained tight lipped about his opinions of his fellow Demon Lords. This cowardly side of Clayman was evident when he believed he had full control over Milim, and only then did he start insulting her and expressing his personal disdain, showing his cowardice.\nWhen things appeared to go according to his plan, Clayman's arrogance and overconfidence became evident. He made tactical errors in his attempts to manipulate Rimuru and Tempest, such as assuming he had successfully mind controlled Milim, despite her reputation for being uncontrollable. He also believed that Frey was solely loyal to him and underestimated Rimuru and Shion, thinking he could overpower them due to his supposed control over Milim. This arrogance was a prevailing trait noted by both Kagali and Laplace, despite their warnings for him to adjust it.\nHowever, it's worth considering that Clayman's brainwashing by Tatsuya Kondou may have contributed to his overconfidence and poor decision making. This behavior was unlike his cautious and cunning nature.\nDespite his manipulative and power hungry tendencies, Clayman, like his creator, displayed gentleness and consideration towards those he considered his friends and comrades, such as the Moderate Harlequin Alliance. He also demonstrated absolute loyalty to his superiors and followed their orders. This loyalty was evident in his final moments, where he refused to reveal any information about his superiors or comrades during his confrontation with Rimuru, even when faced with the threat of complete eradication of his soul. Raphael calculated that it would be extremely challenging to make Clayman talk.\nClayman was known to be a highly cautious Demon Lord, always having backup plans for various situations and reinforcing those plans with additional backups. This preparedness was apparent on multiple occasions, particularly during Walpurgis, where he initially fought Shion using a sword and swiftly transitioned to using Marionette Dance when the sword was destroyed. He resorted to his trump card, the Demon Marionette curse, only after his initial tactics failed and ultimately transformed into the Crazy Pierrot form to take matters into his own hands.\nHowever, upon transforming into Crazy Pierrot, Clayman's calm demeanor was reversed, seemingly becoming more aggressive. It's important to note that this transformation allowed him to restrain his enemies, granting him the freedom to attack and neutralize them more effectively.\nClayman took great pride in his position as one of the Ten Great Demon Lords and cherished his title. This pride was evident when he transformed into his Crazy Pierrot form in response to Shion calling him an unworthy Demon Lord. He believed that, as a Demon Lord, he should dispose of his enemies with elegance and style.\nBackground\nClayman was created by Kazalim as a Deathman many years ago to be part of the Moderate Harlequin Alliance, known as The Crazy Pierrot. Kazalim himself personally designed Clayman to be a tactical commander and a schemer, similar to himself and created him for the expressed purpose of turning him into a Demon Lord.\n300 years ago, he became one of the Ten Great Demon Lords with Kazalim's help, in order to increase his own influence in the Demon Lord Council. The moment he became a Demon Lord, he began hunting down Majin and monsters to steal their hearts (literally). Making them swear loyalty to him, he inscribed a curse onto their hearts, making them his eternal servants. That's how Five Fingers was born, containing cursed pet Ninehead, Immortal King Adalman, top lieutenant Yamza, witch Mjurran, spy and intelligence collector harpy Pirone.\nEventually his master was killed and replaced by Leon Cromwell on the Demon Lord Council. With Kazalim gone, Clayman had to take over his domain, the Puppet Nation Jistav and all of his remaining forces. Clayman hadn't received any words from him for a long time, but still considered himself to be the subordinate of Kazalim. He still continued working on his goals, while still waiting for his master's return.\nClayman wished to get rid of Leon in retaliation for Kazalim's demise. In order to achieve this, he hired many mercenaries, however, they all failed to carry out the task, instead getting slain by Leon's entourage each time.\nClayman, alongside Carrion and Frey, were considered the new generation of Demon Lords, so they would work together in order to expand and increase their influence and power base. Their goal was to bring the gap of power between them and the older generation Demon Lords. Being one of the active Demon Lords, his name was greatly known among humanity and other nations, though much more infamously due to his manipulative tendencies. Clayman was close enough to taking over the entire world, and it was all through his trading relationships, which, generally most Demon Lords won't do. He was the wealthiest among all the Demon Lords, and his wealth did not only come from trading but from the artifacts that were buried beneath the ruins of Amrita which ultimately made him a powerful foe politically and economically. Damrada states that Demon Lord Clayman was a valuable trading asset for the Eastern Empire.\nAt some point, he met a mysterious patron who offered Kazalim's resurrection in exchange of the Moderate Harlequin Alliance's help in taking over the world. Clayman agreed to this request. \n\n* The \"Clay\" from Clayman comes from the word Klei, which means string or wire. Thus his name can be inferred to mean Stringman.\n* To keep his mind sharp on a daily basis, he regularly played chess.\n* During the era of the Ten Great Demon Lords, Clayman was effectively the wealthiest Demon Lord among his peers, with a large amount of wealth earned from trading with the Eastern Empire and several other influential nations and parties, while the rest came from selling several artifacts that once belonged to Kagali's old city of Amrita.\n* Kagali states that she had to sacrifice much of his raw power during his creation in exchange for more intellectual ability and intelligence, thus explaining why he is weaker than his peers in the Moderate Harlequin Alliance.\n* It was also mentioned by Kagali that Clayman has the best control of emotions and temper amongst the Moderate Harlequin Alliance. Unlike others, he could easily contain and control himself, hiding his true feelings and thoughts. This also greatly backfired on him, as after the disappearance of his mentor, Clayman began to feel more insecure about his strength, feel inferior, annoyed by the fact that he is not at the same level of power as his close friends, and even more annoyed thinking that he has not yet met his mentor's expectations.\n* Clayman's graceful speech on Walpurgis was not just a mask that he would put on in front of others, but rather his true personality trait. The Japanese language has two first person pronouns - \"ore\" and \"watashi\". \"Ore\" is meant for use by males, at times it also implies the arrogance and haughty attitude of the speaker. Whereas \"watashi\", just like the female first person pronoun it symbolizes, represents grace, manner, and respect in the speaker's tone. Clayman never once used any other first person pronoun aside from \"watashi\", neither when he was narrating his version of Carrion's \"betrayal\", nor when he was on the verge of death, proving Clayman's graceful speech manners were authentic, not some facade.\n* Clayman was the only one among his fellow Jesters who couldn't meet his master Demon Lord Kazalim personally after he assumed the form of Kagali, Yuuki's secretary.\n* There were obvious hints that Clayman was being brainwashed. The first hint was that he was exposing himself as the mastermind behind Eurazania's invasion as well as unknowingly revealing his scheme to become a True Demon Lord. The second hint was that he refused to wait as ordered by his master Kazalim, which was something he generally wouldn't do as he'd always follow his orders to the letter.\n* Even if Clayman did survive his battle against Rimuru by fleeing the Walpurgis through the use of his Giant Magic Missile or fake his death and flee the Banquet by his Astral Body, he would most likely lose his title as a Demon Lord either way.\n* Much like his creator Kazalim, Clayman lost his Demon Lord Council's seat and his life due to a newcomer Demon Lord.\n* Clayman's initial appearance greatly varies in the anime and the manga.\n* It is highly implied that the only reason Clayman held his Demon Lord's seat and caught up to the other Demon Lords despite being the weakest was due to his scheming capabilities.\n* Excluding his fellow peers (till his scheme was revealed), Clayman was disliked by majority of the Demon Lords, for either being a newcomer and a schemer who aimed too high for his abilities, or for his treatment of his subordinates, or the fact that he is very weak or a combination of all the above here.\n* Clayman achieved a certain proficiency over pastries, especially in the production of confectionery products such as scones, biscuits, cakes and pies. His homemade products were scrumptious, even more so when paired with aromatics teas grown and harvested on Jistav's local fields.\n* In order to utilize and perfect his pastry skills, Clayman regularly announced and invoked tea parties with fellow Demon Lords, not forgetting to elicit new facts and information from the guests.\n* Clayman was one of the few Demon Lords that was liked and recognized by Guy Crimson's maid - Rain. She appreciated his coordination skills and respected his courage to call himself a Demon Lord, even when he was weaker then herself. Rain liked the convenience he offered her, as after prodding him a little, he would handle the tasks which she found troublesome. He was an overall useful person to her. Rain greatly regrets his loss, reasoning that he chose the wrong person to oppose.\n* Considering Guy Crimson being the mediator of the world, it is highly possible that he would oppose Clayman's plans to conquer the world, which was already in place thanks to his trading relationships.\n* Despite being killed during the events of The Octagram Soars Brightly, his name was still often brought up in later volumes as a benchmark to describe the strength/energy amount of new characters. The author jokingly mentioned that Clayman effectively became a \"combat strength measurement unit.\"\n* Ever since Clayman became a Demon Lord, he did not use his Crazy Pierrot form for many years. The only time he was seen using it was during the Walpurgis Banquet to confront Shion.\n* His Japanese VA in anime, Takehito Koyasu, is well known for playing twisted and manipulative evil masterminds, such as Dio Brando in JoJo's Bizarre Adventure and Sugou Nobuyuki in Sword Art Online. Needless to say, this is very fitting for Clayman's character.\nClayman's Abilities:\nClayman, being weaker than the other Moderate Harlequin Alliance members, was created with better brainpower and information management, which made him more suited for the role of a commander and strategist.\nClayman's Skills:\nClayman's Unique Skills\n   * Manipulator\n   * Marionette \n   * This ability allows to forcibly take control of his subordinate's physical body against their will, also allowing to effectively observe the surroundings from a bird's point of view.\n   * Leyline Manipulation \n   * The user can collect intelligence through the naturally occurring ley lines using electric signals and geomagnetism.\n   * Information Encryption\n   * Manipulator's primary ability. It can convert information into encrypted communications as it conducted surveillance over a wide area. Deploying a member of his team to an area allowed them to function as his eyes and ears to gather intelligence. And could also be used to encrypt the information of things the users sees to more easily analyze/decipher them.\nClayman's Intrinsic Skills:\n   * Magic Resistance \n   * Resistance type skill that reduces the effects of Elemental Magic under a certain threshold to be negligible.\nClayman's Extra Skills:\n   * Ultraspeed Regeneration \n   * Grants the user incredible regeneration properties, far superior to Self Regeneration.\n   * Magic Sense \n   * Allows the user to observe the interactions between Magicules and the matter around them to create a mental image of their surroundings.\n   * Magic Manipulation \n   * Allows the user the ability to directly interfere with someone else's magicules and disrupt their abilities, while also dramatically improving the user's precision in manipulating magicules.\nClayman's Common Skills:\n   * Thought Communication \n   * It allows the user to communicate telepathically with multiple people, and is much stronger than Telepathy which only allows for conversation for up to two people.\nClayman's Tolerances:\n   * Physical Attack Resistance \n   * Resistance type skill that reduces the effects of physical attacks (Slashing, Piercing, Blunt, etc.) under a certain threshold to be negligible.\n   * Spiritual Attack Resistance \n   * Resistance type skill that reduces the effects on the mind/spirit under a certain threshold to be negligible.\n   * Abnormal Condition Resistance \n   * Resistance type skill that reduces the effects of things such as poison, paralysis, petrification, and etc. under a certain threshold to be negligible.\nClayman's Arts\nClayman's Battlewill\n   * Magic Bullet \n   * The user gathers their aura and surrounding magicules to form a dense ball of energy before firing at their target. One of the most basic arts but extremely versatile and scales to the users power.\n   * Maximum Magic Bullet \n   * The user gathers an intense amount of Aura into a magic bullet. It is capable of destroying a rather large area and completely obliterating the target's body.\nMagic\nDark Magic\nSpirit Magic\nClayman's Elemental Magic:\n   * Weakening Magic\n   * Mental Magic\n   * Demon Marionette \n   * The ultimate dominating magic in Clayman's arsenal, capable of controlling even Demon Lord level entities such as Ninehead. Summons ominous strings of black light streamed from both his hands and wraps themselves completely around the target's body and attempt to takeover their spirit placing them under the user's control.\n   * Demon Dominate \n   * Similar to Demon Marionette, this ability allows Clayman to place the target's mind and body completely under his control.\n   * Marionette Heart \n   * A magic heart replacing device that turns the receiver into a Majin. In return, the caster keeps the original heart of the receiver, allowing them to kill the target easily. Additionally, it emits encrypted information through electronic waves that allows the user full monitoring of the receiver without being noticed.\n   * Illusion Magic\n   * Channeling \n   * Magic that allows the user to telepathically share ideas similar to Thought Communication.\n   * Magic Sensor \n   * Magic that allows the user to detect magical elements in the air, usually used in conjunction with Magic Sense.\n   * Creation Magic\n   * Create Golem \n   * Magic that allows the user to create Golems.\n   * Spatial Magic\n   * Dress Change \n   * Magic that allows the user to instantly swap out their equipment with replacements inside spatial storage or similar without the need to undress.\n   * Spatial Storage \n   * Magic that allows the user to store items within a sub space.\n   * Enhancement Magic\n   * Strength \n   * Magic that greatly raises the physical strength of the target.\n   * Other Magic\n   * Magic Call \n   * Magic that allows for one way alternating telepathic communication from long distances, similar to a walkie talkie.\nOthers\n   * Demon Blaster \n   * Using the energy from his pseudo awakening, Clayman can fire a massive blast of magical energy. The ley lines gathered around the world with the addition of his own magicules allows the pulse of the earth to be transformed into blasts of disturbance effect to attack the enemy. Blasts projected from Demon Blaster rise from the ground like a flying dragon. Anyone caught in it would have their arrangement of magicules thrown into chaos, destroying them from the inside out. Physical resistance would be useless, and even a magical Barrier would be instantly smashed.\n   * Marionette Dance \n   * Allows the user to manipulate golems bearing the souls and abilities of Majin as if they were an extension of the users body. Due to their nature as golems, the dolls can regenerate from any damage as long as their Spiritual Body is intact.\n   * Marionette Rush\n   * One of Clayman's ultimate aggressive combat moves. In his Crazy Pierrot form, Clayman fires a beam of Demon Marionette energy towards his opponent, and binds them completely, thereby restricting any movements and follows it up by throwing his weapons, including his shield towards them.\nClayman's Equipment\n   * Crazy Pierrot Mask\n   * As a member of Moderate Harlequin Alliance, Clayman also wore a mask in order to share suffering and stand in solidarity with his master. He always carries it with him in the inner pocket of his tailcoat. The Crazy Pierrot Mask is a symmetrical mask of white color with long black maniacal smile and spiteful eyes. On the forehead of the mask a crescent symbol is present.\n   * Orb of Domination \n   * High class artifact hand made by \"that person\". Powerful artifact enhanced by great amount of Clayman's magicules, that is able to control creatures whose power can be compared to Demon Lord. In the anime adaptation, the Orb of Domination is put into a necklace, while in manga adaptation it is put into a wrist bracelet.\n   * Demon's Ring \n   * A ring that is given to each member of the Demon Lord Council. It allows to make \"Cross Spacetime Communication\" with other Demon Lords. It has the secret call function for individuals, and also the ability to make a group call. With Demon's Ring, it is possible to make calls even from \"Infinity Prison\".\n   * Various Rare and Unique Grade Weapons"
    },
    {
        "name": "Milim's Dominion",
        "detail": "City of the Forgotten Dragon\nDragon Faithful\nDragon Faithful are human looking Dragonewts that worships Milim Nava as their Goddess. The high ranking members even often train and eat together with Milim. The faithful themselves offer her some of their farmed vegetables as offerings to Milim, however despite accepting and eating them, Milim herself never really liked them due to being raw vegetables and was noted to have a empty/unsatisfied expression as she eats them. She likes those well cooked meals she experienced in Tempest.\nGaia\nGaia is her pet dragon and best friend. she went on a rampage when Gaia was killed because she was one of her only family left at the time.\nBeast Kingdom Eurazania\nCarrion\nThey used to be fellow Demon Lords, though after being defeated by Milim and confirming he's still too weak to be among the Demon Lords, Carrion decided to step down and become Milim's subordinate.\nHarpy Kingdom Fulbrosia\nFrey\nFrey is now a mother like figure for Milim as she is always carefree and doesn't do her duties like maintaining her domain. They used to be fellow Demon Lords and were quite close to each other, to the point of plotting together to overthrow Clayman. After the Walpurgis Banquet that ended with Clayman's death, Frey confirmed herself to be too weak among the Demon Lords and decided to step down and become Milim's subordinate. Ever since then, she would serve as a nagging secretary to Milim as she would drag Milim back to work and studies whenever she lazes around.\nJura Tempest Federation\nRimuru Tempest\nShe and Rimuru became close friends over the course of her stay in Rimuru City. Shortly after her arrival, Rimuru gave her \"Dragon Knuckles\" to inhibit her power so she wouldn't hurt or kill any of his citizens accidentally. Milim considers Rimuru her \"Bestie\" and her only \"True Friend.\" Later they became fellow Demon Lords of Octagram after Rimuru became a True Demon Lord. Milim sometimes runs away from her domain (as she hates responsibilities like ruling) to hang around with Rimuru and eat sweets in Tempest, as well as play their four player pseudo multiplayer RPG via their \"dungeon avatars.\" She's also very grateful for him saving Gaia from being Chaos Dragon.\nVeldora Tempest\nMilim's Uncle. They grew closer as they usually play in the Tempest Labyrinth's together.\nShion\nShion has faith in Millim knowing that she would never betray Rimuru through her intuition.\nDemon Lords\nOctagram\nGuy Crimson\nGuy is part of the first generation Demon Lords along with Milim and have been acquainted with each other for thousands of years. One of the only people capable of fighting Milim seriously and forcing a draw, as shown when he initially tried stopping Milim's rampage.\nRamiris\nRamiris is part of the first generation Demon Lords along with Milim and have been acquainted with each other for thousands of years. Milim later became a closer playmate with Ramiris due to Rimuru's influence.\nOther Demon Lords\nClayman\nMilim is very disrespectful toward Clayman and thinking he's a weakling. She pretends to be brainwashed by the necklace he made Fray give her so she could find out what he was planning and who was his boss."
    },
    {
        "name": "Octagram",
        "detail": "Octagram refers to an exceptionally powerful group of existences in the Tensei Shitara Slime Datta Ken universe. Although few have been active, they have all been ranked at least Disaster simply for being members of the council.\nWhen the time comes for the birth of a new Demon Lord, other Demon Lords will not stay silent. If a fool freely calls themself a Demon Lord, they will be killed for invoking the Demon Lords' wrath. However, if said person could withstand the wrath of a Demon Lord, they themselves would be recognized as such. But that did not tend to be a common occurrence.\nFor a stranger to claim the title Demon Lord, it was necessary to gain the support of at least two or more Demon Lords – as if you messed with the new Demon Lord, the supporting Demon Lords will become opponents at the same time.\nThere is a non aggression pact between the Demon Lords. However, if one initiates a fight, they may gain the wrath of all the other Demon Lords.\nThe council had many different names in the past, the second most recent being the Ten Great Demon Lords which was later changed by the Demon Lords to Octagram through Rimuru's suggestion, mainly due to Clayman's death and Frey and Carrion stepping down and becoming Milim's subordinates, as well as Rimuru being recognized as a member of the council, resulting in their ranks being reduced to eight.\n\nWalpurgis Banquet\nFrom time to time, the Demon Lord Council would convene in what is known as the Walpurgis Banquet. This meeting takes place in a separate dimensional space and is supposed to handle serious issues, however, very often the members of the council just use it as an excuse to hang around and have a tea party, unbeknownst to mankind, who view every instance of Walpurgis as a precursor to a worldwide war or another Tenma Great war.\nMembers\nSeat\n\tName\n\tTitle\n\tRace\n\tStatus\n\tPlace of Residence/Domain\n\tDemon Lord Allies\n\tOther Notable Allies\n\tDisaster Rank\n\t1\n\tGuy Crimson\n\tLord of Darkness\n\tDevil Lord\n\tTrue Demon Lord\n\tIce Continent,\nFrost Palace\n\tLeon,\nMilim,\nRamiris,\nRimuru,\nDino\n\tVelzard\n\tCatastrophe (Actual)\nDisaster (Officially)\n\t2\n\tMilim Nava\n\tDestroyer\n\tDragonoid\n\tTrue Demon Lord\n\tCity of the Forgotten Dragon,\nBeast Kingdom Eurazania,\nHarpy Kingdom Fulbrosia,\nPuppet Nation Jistav\n\tRimuru,\nRamiris,\nGuy\n\tEx demon lord Carrion,\nEx demon lord Frey,\nMiddray,\nObera\n\tCatastrophe (Actual)\nDisaster (Officially)\n\t3\n\tRamiris\n\tFairy of the LabyrinthLabyrinth\n\tPixie\n\tQueen of Fairies\n\tUlg Nature Park,\nJura Tempest Federation\n\tGuy,\nMilim,\nRimuru,\nDino\n\tBeretta,\nFour Dragon Lords,\nDryads\n\tCatastrophe (Adult Form)\nDisaster (Officially)\n\t4\n\tDagruel\n\tContinent's WrathEarthquake\n\tTrue Giant\n\tTitan\n\tBarren Lands\n\tDino\n\t_\n\tCatastrophe (Actual)\nDisaster (Officially)\n\t5\n\tLuminous Valentine\n\tQueen of Nightmares\n\tHigh Blood\n\tTrue Demon Lord\n\tHoly Empire Ruberios\n\tRimuru\n\t_\n\tCatastrophe (Actual)\nDisaster (Officially)\n\t6\n\tDino\n\tSleeping Ruler\n\tFallen\n\tTrue Demon Lord\n\tBarren Lands,\nJura Tempest Federation\n\tDagruel,\nRamiris,\nRimuru\n\tGracia,\nPico\n\tCatastrophe (Actual)\nDisaster (Officially)\n\t7\n\tLeon Cromwell\n\tPlatinum Saber\n\tDemonoid\n\tEx Hero\n\tEl Dorado\n\tGuy,\nRimuru\n\tElmesia El Ru Sarion,\nSylvia El Ru\n\tCatastrophe (Actual)\nDisaster (Officially)\n\t8\n\tRimuru Tempest\n\tChaos Creator\n\tUltimate Slime\n\tTrue Dragon\n\tJura Tempest Federation,\nWestern Nations\n\tMilim,\nRamiris,\nLuminous,\nDino,\nLeon,\nGuy\n\tVeldora,\nArmed Nation of Dwargon,\nWestern Nations,\nSorcerer's Dynasty Sarion,\nHoly Empire Ruberios\n\tCatastrophe (Actual)\nDisaster (Officially)\n\tTerritory\nAll Demon Lords tend to have a territory they call their own. While not all of them are protective of their homes, some will be immediately hostile should another Demon Lord encroach uninvited, especially if such invasion involves destruction. Areas outside the designated domains do not fall under a Demon Lord's reign unless approved by the Council or the inhabitants wish to serve a Demon Lord.\nRimuru Tempest Jura Tempest Federation (Great Jura Forest at the center of the continent).\nMilim Nava Annexed territories of The City of the Forgotten Dragon, Beast Kingdom Eurazania, Harpy Kingdom Fulbrosia and Puppet Nation Jistav (southeast territories at the center of the continent).\nRamiris Formerly in an isolated part of the Ulgrasia Republic, now residing within the Jura Tempest Federation inside The Dungeon.\nGuy Crimson Northern Continent.\nLeon Cromwell El Dorado (Southern Continent).\nLuminous Valentine Holy Empire Ruberios (Western Nations are partially part of her territory as well).\nDino Formerly residing in the Barren Lands with Dagruel, now in the Jura Tempest Federation within The Dungeon. He is the only Demon Lord with no territory or subordinates to call his own, as such he tends to drift between his fellows' territories to \"mooch\" from them.\nDagruel Barren Lands (Westernmost part of the central continent).\nTen Great Demon Lords (Defunct)\n* Guy Crimson - True Demon Lord; Devil Lord\n* Milim Nava - True Demon Lord; Dragonoid\n* Ramiris - Fairy Queen; Pixie\n* Dagruel- Titan; True Giant\n* Roy Valentin - Bloody Lord; Vampire (Role as a substitute for Luminous Valentine Deceased)\n* Dino - True Demon Lord; Fallen\n* Kagali - Curse Lord; Deathman (Replaced by Leon)\n* Carrion - Beast Master; Lycanthrope (Became Milim's subordinate)\n* Frey - Sky Queen; Harpy (Became Milim's subordinate)\n* Clayman - Marionette Master; Deathman (Replaced by Rimuru)\n* Leon Cromwell - Ex Hero; Demonoid\n\n* Guy is the de facto leader of the group, due to being a powerful Primordial and the first Demon Lord.\n* The previous Ten Great Demon Lords took about 3 months to decide on a name. That ended in naught as the masses already named them without their permission.\n   * Rimuru only took 3 minutes to decide on a name for the current Demon Lords (Octagram), making Dino wonder why they tormented themselves over the name; Rimuru was shocked by their lack of creativity.\n* As stated by Kagali, over 200 years prior to Rimuru's own admission into the group, the Council of Demon Lords once only consisted of seven members prior to the creation of some of the official rules of the Walpurgis Council, including the three majority vote rule.\n   * This was to lessen the damage and loss of life that would occur when two Demon Lords fought; Kagali fought Roy Valentin repeatedly, resulting in intervention (likely by Guy).\n* As the True Demon Lords have gradually diminished their activities over the millenniums, a majority of the world believes that a Demon Lord's overall power is equivalent to a Demon Lord Seed because no being has succeeded in ascending to one for a few thousand years. Carrion, Frey, Clayman, and Valentin, who are the most active members of the Council, have only reached the level of a Demon Lord Seed. Due to this, individuals such as Mariabell Rosso thought they were powerful enough to fight and win against an actual awakened True Demon Lord, as shown in the scene where Mariabell underestimated Rimuru by comparing her power with Carrion's.\n* According to Guy, the \"first generation\" of Demon Lords was him, Millim and Ramiris; the \"second generation\" was Dagruel, Luminous and Dino and the \"third generation\" consisted only of Leon. He doesn't count those that died (Such as Kagali) over the years during the Great Tenma Wars or other incidents.\n* Of the Octagram, Ramiris, Dino and Milim tend to spend their time in Rimuru's territory. Guy, Leon and Dragruel have no interest in Jura, while Luminous wishes to stay away from Veldora.\n* Milim boasts the largest domain out of all the Demon Lords (a combined four territories), with Rimuru coming in second with the Jura Forest.\n* True Demon Lords don't have to join this organization, otherwise it would have 22 members after Rimuru evolved his Twelve Guardian Lords; plus Rain and Misery.\n   * On this note, Guy will investigate if numerous awakened Demon Lord presences emerge, as shown with him questioning Rimuru. This led to him bargaining for his maids' evolution in exchange for putting the matter aside."
    },
    {
        "name": "Demon Lord",
        "detail": "Demon Lord is a term used in two different fashions, either as a Monster class or as a social position. In general, it refers to the strongest or highest ranking among Monsters, however, that is not an absolute rule.\n\nDemon Lord Seed:\nDemon Lord Seed refers to individuals who have met the necessary qualifications to be able to undergo the Harvest Festival and become Demon Lords. In terms of pure Magicules alone, they are at least Special A, with an EP of at least 200,000 being required as one of the qualifications.\nTrue Demon Lord:\nTrue Demon Lord – sometimes reffered to as Awakened Demon Lord – is a term created to distinguish those who call themselves a Demon Lord and those who have undergone the Harvest Festival and become actual Demon Lords.\nHarvest Festival:\nMain article: Harvest Festival\nThe Harvest Festival occurs once all the requirements to become a Demon Lord are met by a Demon Lord Seed. The World Language will confirm the user's intent to become a Demon Lord and the \"Initiation\" will start.\nKnown True Demon Lords:\nThose who are known to be True Demon Lords by the time of Rumbling of Heaven and Earth.\nTrue Demon Lord\nrion\n\nDino\n\nFrey\n\nGuy Crimson\n\nIzis≠\n\nLuminous Valentine\n\nMilim Nava\n\nRimuru Tempest‡\nDemon Lord as Social Position:\nSelf Proclaimed Demon Lord:\nSelf proclaimed Demon Lord refers to any individual that proclaims themselves as such. There are no restrictions to this and even non monsters can claim to be Demon Lords. However, this usually has grave consequences depending on the individual's strength.\nIf the Lord in question is only at the level of a high level Majin or even only at Hazard class, one of the officially recognized Demon Lords will quickly destroy them by either sending their own subordinates to deal with it or attacking themselves, swiftly eliminating the self proclaimed Demon Lord. Alternatively, the Lord might even die to armies or adventurers sent from the humans before the Demon Lords act.\nHowever, if the individual in question is truly at Demon Lord level (Seed or True Demon Lord), then they might be able to fend off or even kill the attacker. If that occurs, rather than being enraged at the newcomer, the other Demon Lords will instead usually view this as a display of strength and invite the newcomer to take the place of the attacker as an official Demon Lord.\nThere are no concrete examples of self proclaimed Demon Lords that have been killed. However, two known Demon Lords became recognized through killing their attackers - Leon Cromwell, who killed The Curse Lord 200 years before Rimuru reincarnated, and Rimuru Tempest, who killed Clayman at the Walpurgis Banquet. In both cases, the Demon Lord Council recognized their strength, allowing them to use the title of Demon Lord and join the Council.\nRegardless of the result, nobody remains a self proclaimed Demon Lord for long.\nRecognized Demon Lord:\nRecognized Demon Lord refers to self proclaimed Demon Lords who have been officially recognized by the established Demon Lords. This can be achieved in two different ways:\n      1. Getting nominated by other Demon Lords to join their ranks and receiving majority approval.\n      2. Self proclaiming to be a Demon Lord and then proving one's strength by defeating a recognized Lord.\nOnce a Demon Lord is recognized, that Lord also becomes a member of the Demon Lord Council and can vote on issues brought up by the council.\nDemon Lord Council:\nFounded by Guy Crimson, the Demon Lord council is an organization containing all the recognized Demon Lords. The number of members and the name of the council has changed multiple times throughout the council's history, but at some point the maximum number of members was capped at ten and the name \"Ten Great Demon Lords\" was established. However, the organization was again restructured during a Walpurgis Banquet, and the resulting organization was labeled as Octagram by the \"newbie\" Rimuru Tempest due to only having eight members.\nThe only condition required to join the council is to become a recognized Demon Lord. Anyone who joins is automatically considered at least Disaster class by humanity just for being a recognized member of the Demon Lord council, regardless of actual power. However, it's nigh impossible for anyone other than Ramiris to join the council without being at least at Demon Lord level of power. After the restructuring, the Octagram has even higher standards since every member is already at least at the level of a True Demon Lord in power.\nAncient Demon Lord:\nAmong the Demon Lords that are part of the Demon Lord Council exist \"generations\" of Demon Lords, with the ones that were its very first members having the title Ancient Demon Lord.\nAncient Demon Lord\n\nGuy Crimson\n\nMilim Nava\n\nRamiris\nEx Demon Lord:\nEx Demon Lords are individuals who are no longer considered part of the Demon Lord Council.\nEx Demon Lord\n\nCarrion\nClayman\nFrey\n\nKagali\n\nRoy Valentine\n\n      * The Walpurgis Banquet is effectively a glorified tea party according to its members. However, because of the immense power and reputation of those attending, most of humanity views a Banquet as a bad omen for the future."
    },
    {
        "name": "Guy Crimson",
        "detail": "Guy Crimson is known as the first of the Primordials and the first seat of the Octagram. He resides in the Ice Continent.\n\nAppearance\nGuy is portrayed as handsome man with blood red eyes as \"stars of gold and silver dancing in them\". His wavy, burning hair is a deep shade of rouge. He's about as tall as Leon and his beauty is prideful and distant. He looks like someone born to lead and conquer. He has his clothes draped over himself, revealing a lot of skin.\nPersonality\nHe is typically characterized as prideful and relaxed. He doesn't usually pay much attention to others, but if someone catches his interest, he will attempt to get closer to them. He displays a forward approach in his relationships, often making suggestive and openly sexual advances towards Leon Cromwell while in his male form, despite Leon's clear preference for women. In response to Leon's rejection, Guy repeatedly offers to transform into a woman, only to be turned down.\nHowever, Guy can also exhibit a caring side towards individuals he recognizes and acknowledges. For example, he continues to engage with Rudra in order to prevent his friend from falling apart emotionally, and he even threatens to become Leon's enemy if Leon harms Ramiris. Additionally, Guy demonstrates a level of respect for those who show no fear towards him, becoming more casual in their interactions. He takes his role as a mediator seriously, and he displays noticeable anger when Rimuru disrupts the balance of power that Guy had maintained for thousands of years. Guy is particularly interested in strong individuals, especially those who possess Ultimate Skills.\nBackground\nGuy was born during the dawn of time, before the creation of heaven and earth. He was one of the demonic counterparts to the Seven Angels of Origin, having split from the Great Holy Spirit of Darkness. As the first among them to be born, he ruled the Daemon Realm as its king and commanded the daemons at will. From his perspective, even the other primordials were mere dependents. However, when Bleu and Vert challenged him in a bid for supremacy, he easily defeated them but discovered that the primordials were immortal. No matter how crushed they were, they would resurrect under the victor's command. This realization led to a stalemate among the remaining four primordials.\nAmong the daemons, the Black Primordial Noir persistently troubled Guy. They fought for supremacy, resulting in a draw. Recognizing Noir's strength, Guy acknowledged him as a rival.\nWith the passage of time, Guy was summoned to the Central World by High Human Emperor Jahil of the Super Magic Empire. He was summoned as an Arch Daemon and tasked with destroying an enemy nation. Using a million corpses, Guy successfully incarnated and ascended to the rank of True Demon Lord, acquiring the souls of numerous people. In addition to destroying the enemy nation, he summoned Primordial Vert and Blue, ordering them to slaughter Jahil and all the residents of the Super Magic Empire while avoiding mass destruction magic to prolong their suffering.\nAs Guy crushed his enemies, he relished in their doomed pleas and found it to be a pleasant sound. He named himself Guy, realizing his awakened state was needless since he already considered himself the strongest. He named his companions Misery and Rain, reflecting the misery of mankind and the blood that fell wherever he went.\nGuy and his maids traveled from place to place, enjoying the world. Eventually, he encountered Veldanava and challenged him to a fight but was easily defeated. Instead of becoming Veldanava's servant, he was given the role of Mediator. It was at this moment that Guy's heart materialized, and he gained the Unique Skill Pride. To alleviate his boredom, he monitored human civilization and destroyed any country engaged in warfare.\nGuy joined forces with the Seven Angels of Origin in a three month assault against the World destroying Dragon, Ivarage. However, Ivarage managed to escape to the otherworld, leaving substantial damage in its wake.\nAfter the battle, Guy surveyed the continent from above and spotted the Imperial Castle of the Super Magic Empire, where he had been summoned. He decided to make the castle his home, believing it to be fate. The Frost Dragon, Velzard, appeared and attacked Guy out of jealousy for his interaction with her brother. Their battle ended in a draw, and during the fight, Guy's power evolved further, granting him the Ultimate Skill Lord of Pride, Lucifer. Intrigued by Guy, Velzard decided to observe him from that day forward.\nThousands of years passed, and Guy, bored to the core, received visitors: Rudra, Velgrynd, and Lucia. Rudra, dropping any pretense of an honorable duel, demanded Guy to hand over all his valuables. Amused by the request, Guy accepted the challenge. Despite Rudra's immense swordsmanship and the support of his sister's Holy Field and Holy Blade spells, Guy analyzed and replicated his every move, becoming stronger as the fight continued. However, Rudra halted the challenge and named Guy, as he didn't want to fight a Demon Lord with a funny name. Thus, Guy was renamed Guy Crimson based on his red hair color. From that point on, the two engaged in daily fights with no clear winner emerging.\nOne day, Rudra proposed a change in their matches. Realizing that their direct battles would never lead to a resolution, Rudra suggested using their subordinates as proxies, with the winner claiming dominion over the entire world. Unfortunately, this ideal was not meant to last. Tragedies unfolded since the inception of the game between Guy and Rudra. Shortly after Veldanava and Lucia had their child, Milim, a terrorist attack occurred in the Nasca Kingdom, taking advantage of Rudra's absence. The attack, orchestrated by a warring enemy, resulted in the deaths of Lucia and Veldanava. Another tragedy befell Milim when her pet dragon was killed by a foolish kingdom. Enraged, Milim destroyed the country and awakened in the process. Guy intervened and battled Milim for seven days and nights, turning the once bountiful fields into a wasteland. In the end, there was no clear winner, but with Ramiris' assistance, Guy managed to calm Milim down. These events plunged Rudra into deep depression, forcing Guy to continue the game to keep his friend from falling apart.\nTitle(s)\nLord of Darkness\nTrue Demon Lord\nAncient Demon Lord\nMediator\nPrimordial RedRouge\nAlias / Epithet / Nickname\nRouge\nRed\nHost\nDeathman\nBiological\nSpecies\nDaemon (Devil Lord)\nPreceding Evolution Path\nDaemon Lord\nArch Daemon\nKind\nForeigner\nGender\nGenderfluid\nAge\nSince The Dawn of Creation\nHair Color\nRed\nEye Color\nRed\nStatus\nAlive\nSocial\nRelative(s)\nOrthos \nRed Colored Daemons (Descendant)\nBase of Operation\nFrost Palace, Ice Continent\nOccupation(s)\nDemon Lord\nRank\nSpecial S\nDanger Rating\nCatastrophe (Actual)\nDisaster (Officially)\nAffiliation(s)\nOctagram"
    },
    {
        "name": "Unique Skills",
        "detail": "Unique Skills are Skills that, as the name suggests, are Unique and only exist one at a time. They are the next stage of Skills after Extra Skills. Unique Skills are described to be the \"shape of the mind\".\n\nCharacteristics\nUnique Skills usually are composed of multiple Sub Skills which might be Common Skills or Extra Skills, or have a sub Skill that is unique to that specific Unique Skill.\nThere are conditions that need to be met to obtain Unique Skills. One of the conditions is that the bearer must have desires. Someone who has no desires or strong feelings can't obtain a Unique Skill, as Unique Skills are the shape of the mind. Even if someone successfully steals a Unique Skill from someone else, if its nature doesn't fit the new user, the potency of the Skill will be greatly lowered. Another condition is that the user needs to have a certain amount of Magicules available, as obtaining a Unique Skill causes one to permanently lose Magicules.\nIt's for that reason, various Human nations are summoning Otherworlders, as Otherworlders, when crossing over between worlds, go through a fundamental change due to going from a physical world to a mixed physical and spiritual world, and in the process often gain a Magicule compatible body that is more likely to obtain Skills than Inhabitant Humans. Summoned Otherworlders in particular have a higher chance to obtain a Unique Skill when summoned - which is also the reason why the nations usually put a slavery curse on their Summons, as they might otherwise kill their summoners in retaliation and escape due to their unpredictable Unique Skills.\nAmong Unique Skills, there are those that exist on a different plane in terms of effectiveness, some of them being the Sin skills or skills associated with Angels. Infinity Prison, Absolute End, and Chosen One are other examples. The effect they exert reaches the level of Ultimate Skills."
    },
    {
        "name": "Ramiris",
        "detail": "Ramiris is one of the first generation of Demon Lords, alongside Guy Crimson and Milim Nava, the third seat of the Octagram, and the manager of the Dungeon. She is also the Hero's Guide, said to bestow Divine Protection on Chosen Heroes. She preserves the balance of the entire world. She currently resides in Tempest.\n\nAppearance\nShe is flat-chested and small enough to rest on a flower. She has blonde hair that is done in pig-tails and has yellow eyes.\n\nSpecies\nPixie\nKind\nReincarnated Inhabitant\nGender\nFemale\nAge\n50 (Current Incarnation)\n20,000+ (Including All Incarnations)\nHair Color\nBlonde\nEye Color\nGold\nStatus\nAlive\n\nPersonality\nShe is a pleasant person. Though one doesn't feel a shred of a Demon Lord's dignity from her, she is nonetheless a pleasant person. Also, she is completely oblivious to her complete lack of a presence. Without listening to others at all, she just says whatever she feels like saying. She is a ridiculously free-willed individual. She acts a little smug due to being both the Elemental Queen and a Demon Lord but has no problem in helping Rimuru after finding out why he went to the labyrinth.\n\nBackground\nThousands of years ago, Milim awakened as a Demon Lord at the same time as Guy due to her pet dragon being killed by some country. In her anger, Milim destroyed the country and awakened as a True Demon Lord. Unconsciously, she fought with Guy. That battle continued for seven days and seven nights, transforming the bountiful lands in the west into a wasteland.\n\nEventually, the battle concluded. Milim regained her consciousness and the battle ended. The one who returned her sanity was Ramiris. In the process, the ruler of Elementals Ramiris absorbed the evil magic of Daemons and the powerful aura of Dragons and began to change, transforming into a corrupted Elemental. But, she was able to stop Milim's rampage. And the three settled this dispute.\n\nThese three were the first Demon Lords. They decided that each of the three would be different than the other two. One would pursue the Ultimate Skill. One would live as they please. One would judge the world. Because their objectives were different, they could recognize each other.\n\nOnce, Leon Cromwell came to the Dwelling of Spirits before he became a Demon Lord. Ramiris' Thought Manipulation had no effect against him, in fact, she was controlled instead. For Ramiris, who was only proficient in the illusion magic of spiritual magic variety, there was nothing else she could do. Therefore, she planned to have the golem become her arms and legs. With that, she then went out and lost to Leon, and had to help him out. He was researching how to summon ghosts. Without a single clue, he had managed to summon a high-level fire elemental out of pure anger and then sealed the elemental away. Then, he made an absurd request, to summon a specific otherworlder. She told him it was impossible. \n\nAfter the magic soldiers that the dwarves and elves had researched together went wild after they failed to use the heart, the spirit magic circuits from that research were thrown out. So, the fairies picked up the shell that they threw out to modify and improve their golem.\n\nTitle(s)\nLabyrinth FairyLabyrinth\nDemon Lord\nAncient Demon Lord\nFairy Queen\nAdministrator of the Stars\n\nShe gets so used to telepathy that she sometimes forgets how to talk. Though that somehow doesn't stop her from being talkative.\nRamiris' Skills:\nRamiris' Intrinsic Skills:\nSmall World:\nIt allows the user to create a near-endless labyrinth of isolated space with particular dimensions and shapes tailored to their liking. It's an authority that can even isolate dimensions and is difficult to break from outside, it is possible to penetrate one or two floors by distorting the dimension and destroying it by force, but it's almost impossible to penetrate multiple floors at once even for a True Dragon like Veldora with Velgrynd being the only one so far that shown to penetrate fifty floors at once due to Raguel's Charity.[2]\n\nThere's no limit to the number of floors that can be constructed, but realistically, due to the energy cost required to create and maintain floors rising exponentially, Ramiris' limit is 100 floors. It is possible to extend this limit with a strong power source like Veldora providing extra Magicules to fuel the Skill. A single floor needs an hour to be finished, but can be customized in a single moment, the decor aside. Customizing the interior is one of the functions of this skill. It's also possible to create a rotation of floor patterns, but only one floor at a time.\n\nBy wearing a special item created via the skill, in case of death, the wearer is resurrected on the surface. Alternatively, if the user is aware of the person who entered, the user may manually revive them. Inside the labyrinth, the user's subordinates are immortal. If the user's subordinate gets killed, they'll disappear and respawn at a set location. There is no revival limit, making the user's subordinates almost undefeatable.\nRamiris' Extra Skills:\nSpiritual Manipulation:\nSpiritual Manipulation is an Extra Skill used to influence others' actions.\nAllows the user partial control over the target's thoughts and desires.\nCommon Skills\nTelepathy:\nA Common Skill used by many monsters as a means of communication.\nIt allows two people to have a conversation with their thoughts through the exchange of magicules.\nRamiris' Magic:\nSpirit Magic:\nPrinciples\nIt borrows the power of Spirits (most commonly Elementals) by using a small amount of the user's energy as a catalyst, the spirits powers can be exercised. Spirit Magic that utilizes the power of elementals — beings whose existence are based on natural phenomena, obey the laws of physics and can be cast even when an anti-magic field is active.\n\nSpirit Magic requires no chants and anyone can use it as long as they are connected with their contracted spirits. However, it is necessary to be liked by spirits in order to be recognized and form a contract. Higher level users can even summon their contracted spirits and utilize their power directly, by ordering them to attack or fusing with the summoner.\n\nTypes\nAmulet Art:\nAstral Bind: A powerful spell that can bind the target's Astral Body.\nFlame Spirit Magic:  is the Magic used by Fire and Flame Spirits.\nFlame Breath\nInferno Flame\nWind Spirit Magic:  is the Magic used by Wind Spirits.\nAerial Blade\nThornbind\nEarth Spirit Magic:  is the Magic used by Earth spirits.\nWater Spirit Magic:  is the Magic used by Water Spirits.\nDarkness Spirit Magic:  is the Magic used by Darkness Spirits.\nTime Spirit Magic\nLight Spirit Magic\nSpace Spirit Magic\nIllusion Magic\nRamiris' Other Abilities:\nSpirit Engineering\nRamiris' Equipment:\nDemon's Ring\nMagic Item\nMagic Communication Enchantment"
    },
    {
        "name": "Secret Arts",
        "detail": "Secret Art of Revival: Regenerates the damaged Soul of a deceased target, making it possible to resurrect the target with the Secret Art of Resurrection.\nSecret Art of Resurrection: Returns the available and intact Soul of a deceased target to its Body, reviving the target.\nSecret Art of Spiritualization: Transforms the target's Material Body into a Spiritual Body, effectively transforming the target into a Spiritual Lifeform that can survive without a Material Body.\nGreat Secret Art:\nGreat Secret Arts:\nPossession: Transfers the target's Spiritual and Astral Bodies into another person’s body. This allows the target to elongate their lifespan and inherit their new body's Skills and abilities, though at the cost of losing the Skills attached to their previous body.\nMystery Art:\nMystery Arts:\nReincarnation: Reincarnates the Soul and Astral Body of the target into a newborn body, thus resetting their lifespan. The target is temporarily weakened due to their juvenile state, but retains their knowledge and experience."
    },
    {
        "name": "Shizu",
        "detail": "Shizu, formerly called Shizue Izawa, was the companion of the previous Chosen Hero as well as a Japanese Summoned Otherworlder. She was also known as the Legendary Hero \"Conqueror of Flames\", an A+ ranked Adventurer of the Free Guild's Headquarters and the former homeroom teacher of the Freedom Academy's S Class students.\n\nAppearance\nShizue was a young woman of average height with black eyes and black hair, as well as red burn scars under one of her eyes. After separating herself from Ifrit and becoming human once more, she slowly became a frail old lady with white hair.\n\nPersonality\nShizu was a friendly and kind adventurer who was a good teacher to her Otherworlder students. She cared a lot about people close to her and would go to great lengths to protect them. Shizu hated her power comparing it to a curse rather than a gift. Due to killing her friend, she became detached and it wasn't until meeting the hero that she regained her smile.\n\nAs Shizu was an Otherworlder who was forcibly summoned she hated the world but at the same time couldn't dislike it either as the bonds she made were also important to her. She was also noted to be a very strict teacher to the point of her earning the nickname \"The Demonic Head Instructor\". Shizu acted as a mother figure to her students and was constantly worried for their safety and wellbeing particularly, Hinata.\n\nBackground\nIn her original world, she had no relatives and lived alone with her mother. Her father was drafted, and she couldn't recall his face. Feeling neither blessed nor unfortunate, she had no choice but to accept it. She was injured during the Bombing of Tokyo during World War II. She was eight at the time. Although she was summoned to this world during the bombing, it was not before she was badly burned. As she arrived, it was thus revealed that Demon Lord Leon Cromwell was responsible for summoning her. At first, he considered her existence a waste, a mere loss of a failed summoning attempt of Chloe Aubert. However, her sincere plea for help made him change his mind.\n\nLeon reconsidered her value to him and then called forth the Flame Giant Ifrit. He then had Ifrit possess Shizu's body. In truth, he did this to prevent the collapse of her body under the rampaging magic from the summoning. Thus, this possession enabled her to stay alive from both her burn injuries and her unstable magicules from being summoned as a child.\n\nAs a Majin of flames newly named 'Shizu', she became an aide as well as bodyguard for Leon. When the Chosen Hero Chronoa invaded, Leon fled, abandoning his castle. She was left as the rear guard, which Shizu thought to mean she was thrown away by the Demon Lord, but Leon actually hoped, based on the information he gathered, that the Chosen Hero would take Shizu along with them. After fighting the Chosen Hero for some time despite being outmatched, Shizu ran out of magicules and Ifrit's will fell asleep allowing the Chosen Hero, who was actually Hinata in control of Chosen Hero Chronoa's body, to take her in and mentor her. To help control Ifrit's will, the Chosen Hero handed Shizu the Anti-Magic Mask.\n\nHowever, the Chosen Hero left on a journey one day. Since then, Shizue went on to be an adventurer of her own and became a Hero known as the \"Conqueror of Flames\". Sometimes called one of the founders of the Free Guild, she had worked for the expansion and benefit of the Adventurer Cooperation Union. She also took part in training adventurers and her successors. At one time, she had taught two exceptionally excellent students, Yuuki Kagurazaka and Hinata Sakaguchi.\n\nAfter the Adventurers Cooperation Union had formally changed its name to Free Guild, Yuuki introduced the current ranking system. As a result of it, casualties during subjugation missions greatly decreased. Shizue began supporting Yuuki behind the scenes. Due to no longer being able to contain Ifrit, she had to retire from being an adventuring and focused on being a teacher instead. Over time Shizu was even less able to contain Ifrit, thus, she decided to set off to find Leon one more time to find out the method with which Leon saved Shizu as a child so that she can apply the same method to save her 5 current students.\n\nIn the Kingdom of Blumund, via her connection to Franz, Blumund Guildmaster Fuze's father, it got arranged that she'd be traveling together with Kaval's Party into the Great Forest of Jura. During the trip Ifrit finally managed to take over her consciousness once more due to her weakened state, However, with the last of her Will, Shizu was able to separate herself and Ifrit entirely. Not wanting to live with Ifrit in control of her body and letting her die as a \"Human\" instead of a \"Majin\". After Rimuru defeated Ifrit, Shizu's consciousness returned for a short time. Her last request, as a now frail and white haired woman, was for Rimuru to put her to rest within himself, to make Demon Lord Leon Cromwell acknowledge her existence, and to save the children.\n\nMuch later, during the fight with Granbell in Hero Awakening, her memories and emotions inherited by Rimuru manifested themselves inside Rimuru's subconscious mind in order to give Hinata and Chloe closure.\n\nTitle(s)\nConqueror of Flames,\nHero\nFormer Name(s)\nShizue Izawa\nAlias / Epithet / Nickname\nLegendary Hero,\nIfrit,\nDemonic Head Instructor\nBlessing / Divine Protection= Demon Lord's Blessing\nBiological\nSpecies Demonoid/Elemental\nPreceding Evolution Path Human\nKind Summoned Otherworlder\nGender Female\nAge 72-74\nHeight 155cm\nHair Color Black\nEye Color Brown\nStatus Deceased\nSocial\nRelative(s)\nUnnamed Mother\nUnnamed Father (Likely Deceased)\nOccupation(s)\nS Class Homeroom Teacher,\nAdventurer,\nRank S\nAdventurer Rank A+\nAffiliation(s)\nFreedom Academy,\nFree Guild"
    },
    {
        "name": "Otherworlder",
        "detail": "Summoned are the most common type of otherworlder, brought over through summoning rituals. In the process of crossing worlds, the summoned is exposed to a large concentration of magicules dense enough to kill any normal human. Only those that bear a strong soul and mind can endure the strain of the journey.\n\nFrom the massive energy taken in by the summoned, Unique Skills and other special abilities are born as a response to their desires. With these mouth-watering powers, and a strong body that no human can achieve without undergoing grueling training, otherworlders became highly sought after by human nations to serve as a weapon against monsters, and are also employed as bodyguards for nobles and royalty. For this reason, a locking curse is placed on the soul of the summoned to prevent them from fleeing.\n\nThere are very few nations capable of summoning otherworlders due to the sheer costs and level of preparation involved. Even meeting the ideal conditions for a proper summoning, the chances of successfully calling an otherworlder is less than 1%. There's also an inconvenient cooldown in place that prevented the ritual from being performed continuously in quick succession. Due to knowledge circulated by Leon Cromwell, however, a less strict and simplified variant of the summoning ritual was eventually born. While the success rate remained low, it could be used continuously with a reduced cooldown period, but the consequences were that it often resulted in the summoning of children. These children usually had no skills and were left with only their vast magical energy, which, having failed to be converted to skills, would eventually destroy their bodies within five years. Upon Rimuru Tempest becoming a Demon Lord, the ban on the practice of summoning otherworlders was re-enforced, bringing the already illegal practice to a halt even behind closed doors."
    },
    {
        "name": "Stray",
        "detail": "Strays: are otherworlders that arrive by sheer accident. There is no clear cause or pattern known for why this happens, but in general, it's considered a one-way street and the phenomenon is not known to happen in reverse.\nStrays are drawn to the central world through dimensional cracks that spontaneously open in other worlds, drawing in any unfortunate passerbys. They don't get called to fixed locations like summoned and can appear virtually anywhere, including dangerous environments depending on their luck. If they manage to survive whatever dangerous predicament they may face, they can live however they please without worrying about being enslaved.\n\nSince there is no strict standard for who can cross over, strays tend to be on the weaker side compared to other types of otherworlders. Kaoru Yoshida, who is a stray, is virtually no different from the average human. On the other hand there is Hinata Sakaguchi, who obtained two unique skills upon her arrival. As shown with these examples, the strength of strays is very random and can be all over the place, with most not guaranteed to ever obtain unique skills."
    },
    {
        "name": "Reincarnated",
        "detail": "Reincarnator or Transmigrant, refers to individuals that arrive with no body and just their mind, being reborn as an inhabitant of the central world. Reincarnation tends to happen randomly. Although there are those among the reincarnated who still remember their past life, to have reincarnated from a different world is exceedingly rare. Moreover, one would normally be reincarnated as a human. For someone to be reincarnated as a monster, and from magical energy itself, was something that remained unheard of. The only known example of this is Rimuru Tempest."
    },
    {
        "name": "Known Otherworlders",
        "detail": "Chloe Aubert"
    },
    {
        "name": "Reincarnated Summoned",
        "detail": "Mai Furuki"
    },
    {
        "name": "Reincarnated Stray",
        "detail": "Agera\nArios"
    },
    {
        "name": "Known Reincarnated",
        "detail": "Mariabell Rosso\nMujika\nRimuru Tempest\nVenom"
    },
    {
        "name": "Known Summoned",
        "detail": "Alice Rondo\nAlrose\nClaude\nFolgen\nFran\nGale Gibson\nGlenda Attley\nKenya Misaki\nKirara Mizutani\nKizona\nKyoya Tachibana\nLucius\nMaetel\nMark Lauren\nOxian\nRaymond\nRyota Sekiguchi\nShin Ryusei\nShinji Tanimura\nShizu\nShogo Taguchi\nYuuki Kagurazaka"
    },
    {
        "name": "Known Strays",
        "detail": "Bernie\nHinata Sakaguchi\nKaoru Yoshida\nLeon Cromwell\nMasayuki Rudra Nam Ul Nasca\nTatsuya Kondou"
    },
    {
        "name": "Ifrit",
        "detail": "Ifrit was a Greater Elemental; the ruler of flames which was sealed within Shizue Izawa by Demon Lord Leon Cromwell. He was defeated and captured by Rimuru Tempest.\nPersonality\nInitially Ifrit acted like a feral animal with little sense of self, only acting on instinct and would not hesitate to kill the target he perceived as a threat to himself or Leon. This caused great angst between him and his host Shizu, as he would often lose control and attack indiscriminately.\n\nAfter being imprisoned in Rimuru's stomach space, his interaction with Veldora gradually developed his personality and sense of self. By watching Rimuru's interactions with others, he also began to understand the feelings of people and the value of life, causing him to realize why Shizu was always at odds with him.\n\nHe used to live in the Dwelling of Spirits before he was \"stolen\" by the \"Platinum Devil\" Leon Cromwell.[3] After that, he was sealed within Shizue Izawa. As a result of this, she became a demonoid.\n\n\"Ifrit\" does not count as a name, but rather a name for his species (Greater Elemental of Fire).\nSpecies Flame Lord\nGender Genderfluid\nAge 200+\nHair Color Black & Red\nEye Color Golden\nAlive\nCountry of Residence Jura Tempest Federation\nOccupation(s)\nVeldora's assistant\nRank Special S\nAffiliation(s) Veldora Tempest (Master), Leon Cromwell (Former Master)\n\nCharys as Ifrit was a Greater Elemental ranked at Special A.\n\nA maelstrom of flames surrounds the Flame Giant, protecting it at all times. The heat of these flames are so intense that an attack like Rimuru's Water Blade evaporates before it even makes contact.\n\n\nSkills:\nIntrinsic Skills:\nFlame Transformation: It allows the user to transform a Magic or Spiritual Body into flames.\nExtra Skills:\nFlame Manipulation: It allows the user to manipulate existing fire and flames. It can be used to cloak a weapon or target in a fire for added effect or accelerates molecular motion to achive high tempratures.\nRanged Barrier: It allows the user to instantly create a barrier within the range of up to one hundred meters around the user allowing them to trap opponents in it. In its smallest form, the barrier can only cover the body of the user and its power does not change with size, only the cost of magical energy increases.\n\nIt can isolate heat in a way that defies the laws of thermodynamics. It can also be linked to user's various Resist Skills to reinforce the barrier with a maximum of one tolerance for one barrier.\nBody Double: It allows the user to make one or more copies of themself depending on their proficiency and magicules used.\nIfrit can create a large amount of Body Doubles in the double digits, but they're all fragile copies that are easily destroyed.\nArts:\nFlare Circle: Flare Circle first encases the target in a circular Ranged Barrier, before using Flame Transformation to heat up the space within the barrier, alongside Fire Manipulation to accelerate molecular motion in order to achieve high temperatures. As a result, any target enclosed in Flare Circle is scorched by several thousands degrees of heat.\n\nIn addition, the attack is strengthened due to the flame being confined, as the oxygen of the air inside the barrier is consumed rapidly, asphyxiating breathing beings even if they survived the heat. However, evolved species that don't require breathing and possess Flame Attack Resistance won't be gravely injured, as demonstrated by the Orc Disaster when Rimuru casted Flare Circle against him.\n\nShizue Izawa: Ifrit seems to regret his failed connection with his former host. Thinking that at the time, their ideologies were opposed despite sharing a sense of duty."
    }
]