[
    {
        "name": "Veldora Tempest",
        "detail": "Veldora Tempest, also known as Storm Dragon Veldora, is one of the five True Dragons. He has two forms: a human form and a dragon form. In his human form, Veldora appears as a tall, handsome man with blond hair. In his dragon form, he has a gigantic body covered in black steel like scales, with bluish wings and golden eyes. Veldora is known for his boisterous and excitable personality, but he is also easysgoing. Despite his reputation as a rampaging dragon, Veldora is only dangerous when he doesn't get to unwind or when his loved ones are threatened. He is energetic, prideful, and enjoys showing off his strength. Veldora is socially awkward and lacks social tact, often intimidating others without realizing it. However, he is also knowledgeable and curious about many things.
        
        After meeting Rimuru, the protagonist of the story, Veldora starts to reconsider his destructive behavior. He becomes more patient, analytical, and less impulsive. He greatly appreciates Rimuru as his sworn friend and trusts him. Veldora sees Rimuru as an equal and encourages him to bring more entertainment to the world. Veldora also has a deep respect for his older brother, Veldanava, and holds a perpetual fear of his formidable sisters, Velzard and Velgrynd.
        
        Veldora was born as the incarnation of chaos and has control over wind, water, and space. He has always been plagued by a sense of restlessness, leading to destructive rampages and violent storms. His encounters with his sisters have left him with a fear of them. Veldora's boredom led him to destroy a vampire city ruled by Demon Lord Luminous Valentine, which earned him the grudges of the Queen of Nightmares.
        
        Veldora's life changed when he met Rimuru, a slime who became his friend. Rimuru stored Veldora in his stomach while trying to find a way to release him from his imprisonment. During this time, Veldora went through Rimuru's memories and developed a friendship with Ifrit, who joined him in Rimuru's stomach. Eventually, Veldora was released from his imprisonment with the help of Rimuru's evolving abilities.
        
        Currently, Veldora resides in one of Rimuru's clones and shares powers with him through a Soul Corridor. He is functionally immortal as long as Rimuru lives. Veldora is aware of the existence of Ciel, an artificial intelligence, and is one of the few individuals who know about her.
        
        In addition to his dragon abilities, Veldora is also a skilled cook, surprising many with his culinary skills. He works at a Takoyaki stand during festivals and impresses people with his delicious food.
        
        Overall, Veldora is a powerful and lively character who undergoes personal growth and forms a strong bond with Rimuru. His actions and interactions with others play a significant role in the story."
    },
    {
        "name": "Character2",
        "detail": "Details about Character2..."
    }
]